import React from 'react'
import {menu as menuData} from '../../../assets/menu'
import {makeContent} from '../../../utils/makeContent';
import {Footer, Head, Header, InnerPage} from '../../../modules';

const NewsPages = (props) => {

  const pageContent = makeContent(props.data.content)

  return (
    <div className='container'>
      <Head/>
      <Header menu={props.menu}/>
      <InnerPage
        menu={props.menu}
        sidebar={5}
        title={props.data.title}
        paginator={props.paginator}
        pageContent={pageContent}/>
      <Footer/>
    </div>
  )
}

export const getStaticProps = async (ctx) => {

  const paginator = {
    pageCount: 4,
    currentPage: ctx.params.pageNumber,
    forPage: '/media/news/'
  }

  const pagesData = {
    1: {
      page: 'news',
      title: 'Новости',
      content: [
        {post: {
            img: '/news/2020/06/03.jpg',
            date: '03.06.2020',
            title: 'СПЕЦИАЛИСТЫ ДМИТРОВСКИХ ЭЛЕКТРОСЕТЕЙ ОБЕСПЕЧИВАЮТ НАДЕЖНОСТЬ РАБОТЫ ЭЛЕКТРООБОРУДОВАНИЯ ФГБУ «КАНАЛ ИМЕНИ МОСКВЫ»',
            text: 'Дмитровские электрические сети – филиал ФГБУ «Канал имени Москвы» (далее – ДЭС) в штатном режиме обеспечивают безаварийное функционирование энергетического и электромеханического оборудования гидротехнических сооружений ФГБУ «Канал имени Москвы» и осуществляют плановый контроль за надлежащей работоспособностью электрооборудования.',
            link: '/post/postId',
          }},
        {post: {
            img: '/news/2020/06/02.jpg',
            date: '02.06.2020',
            title: 'С НАЧАЛА ГОДА ИНСПЕКТОРАМИ СЛУЖБЫ ГОСУДАРСТВЕННОГО ПОРТОВОГО КОНТРОЛЯ МОСКОВСКОГО БАССЕЙНА ВВП ПРОВЕДЕНО 387 ИНСПЕКЦИЙ СУДОВ',
            text: 'За период с 1 января по 31 мая 2020 года инспекторами государственного портового контроля Московского бассейна ВВП проведено 387 инспекций судов, из них за май – 172. Всего в ходе инспекций выявлено 952 нарушения обязательных требований, из них за прошедший месяц – 426.',
            link: '/post/postId',
          }},
        {post: {
            img: '/news/2020/06/01.jpg',
            date: '01.06.2020',
            title: 'МОСКОВСКИЙ РГС ПРИСТУПИЛ К ДНОУГЛУБИТЕЛЬНЫМ РАБОТАМ',
            text: 'Земкараван Московского РГС - филиала ФГБУ «Канала имени Москвы» приступил к плановым дноуглубительным работам в нижнем бьефе плотины гидроузла «Северка» в Московской области.',
            link: '/post/postId',
          }},
      ]
    },
    2: {
      page: 'news',
      title: 'Новости',
      content: [
        {post: {
            img: '/news/2020/06/01-2.jpg',
            date: '01.06.2020',
            title: 'ГОСУДАРСТВЕННЫЕ ЭЛЕКТРОННЫЕ НАВИГАЦИОННЫЕ КАРТЫ ВВП ГОТОВЫ К НАВИГАЦИИ - 2020',
            text: 'Федеральное агентство морского и речного транспорта уведомляет, что в текущую навигацию 2020 года готово осуществлять доведение государственных электронных навигационных карт внутренних водных путей Российской Федерации (далее – ГЭНК ВВП РФ) на суда подведомственных Росморречфлоту организаций.',
            link: '/post/postId',
          }},
        {post: {
            img: '/news/2020/05/31.jpg',
            date: '31.05.2020',
            title: 'ФГБУ «КАНАЛ ИМЕНИ МОСКВЫ» СЕРДЕЧНО ПОЗДРАВЛЯЕТ РУКОВОДСТВО И ТРУДОВОЙ КОЛЛЕКТИВ ФБУ «АДМИНИСТРАЦИЯ ВОЛГО-ДОНСКОГО БАССЕЙНА ВВП» С ЗАМЕЧАТЕЛЬНЫМ ПРАЗДНИКОМ – 68-Й ГОДОВЩИНОЙ СО ДНЯ ОТКРЫТИЯ ВОЛГО-ДОНСКОГО СУДОХОДНОГО КАНАЛА',
            text: 'В 13 часов 55 минут 31 мая далёкого 1952 г. между 1-м и 2-м шлюзами слились воды великих рек: Волги и Дона, при этом само движение судов по вновь открытому каналу стартовало чуть позже – 1 июня 1952 года, когда по новой водной магистрали прошёл открывший ту легендарную навигацию теплоход «Иосиф Сталин».',
            link: '/post/postId',
          }},
        {post: {
            img: '/news/2020/05/29.jpg',
            date: '29.05.2020',
            title: 'МЕЖВЕДОМСТВЕННАЯ КОМИССИЯ ПРОВЕЛА ПРЕДДЕКЛАРАЦИОННОЕ ОБСЛЕДОВАНИЕ ОБЪЕКТОВ ЯХРОМСКОГО РГС',
            text: '29 мая 2020 года в соответствии с распоряжением Федерального агентства морского и речного транспорта от 28.05.2020 № АП-170-р было проведено преддекларационное обследование дюкера № 79 и донного сброса №122, дюкера №77, дюкера № 100 Яхромского РГС – филиала ФГБУ «Канал имени Москвы».',
            link: '/post/postId',
          }},
      ]
    },
    3: {
      page: 'news',
      title: 'Новости',
      content: [
        {post: {
            img: '/news/2020/05/29-2.jpg',
            date: '29.05.2020',
            title: 'ОБЪЕКТЫ ГИДРОУЗЛА №3 ЯХРОМСКОГО ГРС ПРИЗНАНЫ ГОДНЫМИ К ЭКСПЛУАТАЦИИ',
            text: 'По распоряжению Федерального агентства морского и речного транспорта было проведено преддекларационное обследование гидроузла №3 Яхромского РГС.',
            link: '/post/postId',
          }},
        {post: {
            img: '/news/2020/05/28.jpg',
            date: '28.05.2020',
            title: 'РЕКОНСТРУКЦИЯ РЫБИНСКОГО ГИДРОУЗЛА',
            text: 'На Рыбинском гидроузле в Ярославской области, находящемся в оперативном управлении ФГБУ «Канал имени Москвы», продолжаются работы по реконструкции.',
            link: '/post/postId',
          }},
        {post: {
            img: '/news/2020/05/28-2.jpg',
            date: '28.05.2020',
            title: 'ТЕКУЩИЕ РЕМОНТНЫЕ РАБОТЫ В ТУШИНСКОМ РГС',
            text: 'Тушинский район гидротехнических сооружений – филиал ФГБУ «Канала имени Москвы» в установленном порядке приступил к текущим ремонтным работам в здании главного распределительного щита управления заградительных ворот № 116. Следует отметить, что указанные работы, в том числе, предусматривают ремонт кровли, фасада и внутренних служебных помещений.',
            link: '/post/postId',
          }},
      ]
    },
    4: {
      page: 'news',
      title: 'Новости',
      content: [
        {post: {
            img: '/news/2020/05/27.jpg',
            date: '27.05.2020',
            title: 'РАБОТЫ НА ГИДРОТЕХНИЧЕСКИХ СООРУЖЕНИЯХ ВОЛЖСКОГО РГС',
            text: 'В Волжском районе гидротехнических сооружений – филиале ФБГУ «Канал имени Москвы» проводится ряд мероприятий по поддержанию работоспособности ГТС и безопасности судоходства на вверенных филиалу внутренних водных путях.',
            link: '/post/postId',
          }},
      ]
    },
  }

  const menu = menuData
  const data = pagesData[ctx.params.pageNumber]

  return { props: {data, ctx ,menu, paginator}}
}

export const getStaticPaths = async () => {

  const pageCount = 4 // спросили у апи сколько будет страниц

  const paths = []

  for ( let pageNumber = 1; pageNumber <= pageCount; pageNumber++) {
    paths.push({ params: {pageNumber: `${pageNumber}`}})
  }

  return {
    fallback: false,
    paths: paths
  }
}

export default NewsPages