import React from 'react'
import {menu as menuData} from '../../assets/menu'
import {makeContent} from '../../utils/makeContent';
import {Footer, Head, Header, InnerPage} from '../../modules';

const DocumentsPages = (props) => {

  const pageContent = makeContent(props.data.content)

  return (
    <div className='container'>
      <Head/>
      <Header menu={props.menu}/>
      <InnerPage menu={props.menu} sidebar={3} title={props.data.title} pageContent={pageContent}/>
      <Footer/>
    </div>
    )
}

export const getStaticProps = async (ctx) => {

  const pagesData = {
    portControl: {
      page: 'portControl',
      title: 'Государственный портовый контроль',
      content: [
        {p: 'Служба государственного портового контроля проводит проверку судов и плавучих объектов в Московском бассейне внутренних водных путей, временное задержание судна или плавучего объекта в случае выявленных нарушений, а также дает разрешение на переход судна или иного плавучего объекта к месту устранения выявленных нарушений. Служба государственного портового контроля регистрирует судовые журналы и выдает реестры судовых журналов.'},
        {h4: 'Проверки судов и плавучих объектов в Московском бассейне внутренних водных путей'},
        {p: 'Порядок назначения и периодичность проведения проверок судов и иных плавучих объектов производится на основании оценок рисков нарушения обязательных требований. Оценки рисков автоматически рассчитываются информационной системой государственного портового контроля.'},
        {p: 'Для оценки рисков судна используются следующие параметры:'},
        {ul: [
          'класс судна;',
          'тип судна;',
          'возраст судна;',
          'количество нарушений обязательных требований, выявленных при проверках судна в течение предыдущих 12 месяцев;',
          'количество временных задержаний судна в течение предыдущих 12 месяцев;',
          'отсутствие данных о судне в информационной системе государственного портового контроля.',
          ]},
        {p: 'Баллы оценок рисков не являются оценкой технического состояния судна (приказы Минтранса России № 114 от 10.04.2013; № 308 и № 309 от 15.08.2012).'},
        {h4: 'Временное задержание судна или плавучего объекта'},
        {p: 'Решение о временном задержании судна или плавучего объекта принимается, если по результатам проверки судна выявлены нарушения обязательных требований, создающих угрозу безопасной эксплуатации судна или плавучего объекта и (или) безопасности судоходства.'},
        {p: 'Предельный срок временного задержания судна – до устранения нарушений обязательных требований, но не более 30 календарных дней (приказ Минтранса России № 113 от 10.04.2013).'},
        {h4: 'Процедура снятия временного задержания судна'},
        {p: 'После устранения нарушений обязательных требований, повлекших задержание судна, капитан судна, судовладелец или представитель судовладельца направляет в адрес службы ГПК (или в адрес капитана бассейна) заявление об устранении выявленных нарушений.'},
        {p: 'Устранение нарушений обязательных требований в отношении системы управления безопасностью судов, применяемой судовладельцем, аварийных, спасательных и противопожарных систем и средств судна, включая аварийную сигнализацию, систем радиосвязи и навигационного оборудования, корпусных конструкций, главных и вспомогательных механизмов, оборудования по предотвращению загрязнения с судов, грузоподъемных устройств судна, информации по устойчивости и непотопляемости судна должно быть подтверждено организацией, уполномоченной на классификацию и освидетельствование судов (пункт 1 статья 35 Кодекса внутреннего водного транспорта Российской Федерации).\n'},
        {h4: 'Разрешение на переход судна или иного плавучего объекта к месту устранения выявленных нарушений'},
        {p: 'Для получения разрешения на переход судна или плавучего объекта к месту устранения выявленных нарушений капитан судна, судовладелец или представитель судовладельца направляет в адрес службы государственного портового контроля (или в адрес капитана Московского бассейна) заявку на получение разрешения на переход (приказ Минтранса России № 313 от 17.08.2012).'},
        {p: 'К заявке должны быть приложены:'},
        {ul: [
          'заключение от организации по классификации и освидетельствованию судов, которая осуществила классификацию и освидетельствование судна, о том, что техническое состояние судна позволяет осуществить переход судна к месту устранения выявленных нарушений и о дополнительных мерах, которые должны быть приняты на судне до начала перехода;',
          'подтверждение от организации, которая будет производить устранение выявленных нарушений, которые не могут быть устранены в месте временного задержания судна, о том, что эта организация обладает необходимыми материально-техническими ресурсами, лицензиями и иными предусмотренными законодательством Российской Федерации разрешениями на проведение ремонтных работ и может устранить указанные выявленные нарушения.\n',
          ]},
        {h4: 'Регистрация судовых журналов и выдача реестров судовых журналов'},
        {p: 'Судовой журнал должен быть прошнурован, пронумерован (нумеруются листы начиная с первого), и заверен печатью судовладельца. Регистрация судовых журналов и выдача реестров судовых журналов производится в службе и инспекциях государственного портового контроля.'},
        {h4: 'Нормативно-правовая база службы государственного портового контроля'},
        {fileLink: {
            name: 'Федеральный закон от 07.03.2001 № 24-ФЗ «Кодекс внутреннего водного транспорта Российской Федерации».',
            to: '/captainsService/port/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 15.08.2012 № 308 «Об утверждении Порядка подготовки и содержания плановых (рейдовых) заданий» (зарегистрирован в Минюсте России 28.09.2012 № 25569).',
            to: '/captainsService/port/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 15.08.2012 № 309 «Об утверждении Порядка централизованного учета результатов государственного портового контроля в информационной системе государственного портового контроля» (зарегистрирован в Минюсте России 21.09.2012 № 25510).',
            to: '/captainsService/port/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 15.08.2012 №310 «Об утверждении квалификационных и иных требований к лицам, осуществляющим государственный портовый контроль» (зарегистрирован в Минюсте России 07.09.2012 № 25404).',
            to: '/captainsService/port/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 10.04.2013 № 114 «Об утверждении Порядка назначения проверок судов и иных плавучих объектов на основании оценок рисков нарушения обязательных требований и проведения таких проверок» (зарегистрирован в Минюсте России 16.05.2013 № 28422).',
            to: '/captainsService/port/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 17.08.2012 № 313 «Об утверждении Порядка и условий выдачи разрешения на переход судна или иного плавучего объекта к месту устранения выявленных нарушений» (зарегистрирован в Минюсте России 02.10.2012 № 25580).',
            to: '/captainsService/port/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 17.08.2012 № 314 «Об утверждении Положения о капитане бассейна внутренних водных путей» (зарегистрирован в Минюсте России 10.10.2012 № 25643).',
            to: '/captainsService/port/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 10.04.2013 № 113 «Об утверждении Перечня нарушений обязательных требований, служащих основаниями для временного задержания судна или иного плавучего объекта, и предельных сроков этого задержания» (зарегистрирован в Минюсте России 05.06.2013 № 28683).',
            to: '/captainsService/port/test.pdf',
          }},
        {h4: 'Приложение'},
        {fileLink: {
            name: 'Образец Заявления на получение разрешения на переход судна',
            to: '/captainsService/port/test.pdf',
          }},
        {fileLink: {
            name: 'Образец Заявления на снятие задержания',
            to: '/captainsService/port/test.pdf',
          }},
        {h4: 'Контакты'},
        {fileLink: {
            name: 'Служба государственного портового контроля Московского бассейна ВВП',
            to: '/captainsService/port/test.pdf',
          }},
      ]
    },
    seaPass: {
      page: 'seaPass',
      title: 'Удостоверение личности моряка (УЛМ) и мореходная книжка',
      content: [
        {h4: 'Сроки оформления:'},
        {ul: [
          'удостоверения личности моряка (УЛМ) – 15 календарных дней с момента поступления в учреждение анкеты-заявления о выдаче УЛМ, оформленной в соответствии с требованиями к оформлению;',
          'мореходной книжки – 3 рабочих дня с даты представления документов в учреждение.',
          ]},
        {h4: 'Оформление удостоверения личности моряка (УЛМ)'},
        {fileLink: {
            name: 'документы, необходимые для оформления удостоверения личности моряка',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'требования по заполнению анкеты-заявления',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'образец анкеты-заявления в формате pdf',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'бланк анкеты-заявления в формате pdf',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'образец заполнения представления Российского судовладельца или организации по найму и трудоустройству моряков на выдачу удостоверения личности моряка',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'бланк представления Российского судовладельца или организации по найму и трудоустройству моряков на выдачу удостоверения личности моряка',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'перечень оснований для отказа в предоставлении Государственной услуги по оформлению удостоверения личности моряка\n',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {h4: ''},
        {fileLink: {
            name: 'документы, необходимые для оформления мореходной книжки',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'образец заполнения заявления о выдаче мореходной книжки',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'бланк заявления о выдаче мореходной книжки',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'образец представления Российского судовладельца или организации по найму и ' +
              'трудоустройству моряков на выдачу мореходной книжки',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'бланк представления Российского судовладельца или организации по найму и ' +
              'трудоустройству моряков на выдачу мореходной книжки',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {h4: 'Нормативные документы'},
        {fileLink: {
            name: 'Конвенция Международной Организации Труда № 185 «Об удостоверениях личности моряков» (Женева, 19 июня 2003 г.)',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'Постановление Правительства Российской Федерации от 18 августа 2008 г. № 628 «О Положении об удостоверении личности моряка, Положении о мореходной книжке, образце и описании бланка мореходной книжки»',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'Постановление Правительства Российской Федерации от 21 марта 2013 г. № 250 «О внесении изменений в постановление Правительства Российской Федерации от 18 августа 2008 г. № 628»',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'Постановление Правительства Российской Федерации от 16 августа 2012 г. № 840 «О порядке подачи и рассмотрения жалоб на решения и действия (бездействие) федеральных органов исполнительной власти и их должностных лиц, федеральных государственных служащих, должностных лиц государственных внебюджетных фондов Российской Федерации, а также государственной корпорации по атомной энергии «Росатом» и ее должностных лиц»',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'Федеральный закон от 07 августа 2001г. № 115-ФЗ «О противодействии легализации (отмыванию) доходов, полученных преступным путем, и финансированию терроризма',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 19 декабря 2008 г. № 213 «Об утверждении Инструкции о порядке применения Положения об удостоверении личности моряка»',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 19 декабря 2008 г. № 214 «Об утверждении порядка оформления, выдачи и ведения мореходной книжки»',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 19 июля 2017 г. № 269 «О внесении изменений в Административный регламент Федерального агентства морского и речного транспорта предоставления государственной услуги по оформлению и выдаче удостоверений личности моряка членам экипажей морских судов, судов смешанного (река-море) плавания и судов рыбопромыслового флота, утвержденный приказом Министерства транспорта Российской Федерации от 12 декабря 2013г. № 460»',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса России от 12 декабря 2013 г. № 460 «Об утверждении Административного регламента Федерального агентства морского и речного транспорта предоставления государственной услуги по оформлению и выдаче удостоверений личности моряка членам экипажей морских судов, судов смешанного (река-море) плавания и судов рыбопромыслового флота».',
            to: '/captainsService/seaPass/test.pdf',
          }},
        {h4: 'График приема и выдачи документов'},
        {pbr: [
            'Понедельник - четверг:',
            '08:30 - 16:45, перерыв: 12:30 - 13:30',
          ]},
        {pbr: [
            'Пятница:',
            '08:30 - 15:45, перерыв: 12:30 - 13:30',
          ]},
        {h4: 'Контакты:'},
        {pbr: [
            'Отдел оформления удостоверений личности моряка',
            'Тел.: +7 (499) 638-42-13, +7 (499) 638-42-01 доб. 640, 622',
            'E-mail: ulm@fgbu-kim.ru',
            'Адрес: г. Москва, ул. Водников, д. 16, каб. 1',
          ]},
        {h4: 'Проезд:'},
        {ul: [
          'от станций метро «Сходненская», «Сокол» трамвай №6 до остановки «Канал имени Москвы»,',
          'от станций метро «Тушинская», «Спартак» пешком до ул. Водников',
          ]},
      ]
    },
    certification: {
      page: 'certification',
      title: 'Дипломирование и аттестация',
      content: [
        {h4: 'ФГБУ «Канал имени Москвы» выдает следующие квалификационные документы:'},
        {fileLink: {
            name: 'Диплом члена экипажа судов внутреннего транспорта',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Квалификационное свидетельство члена экипажа судов внутреннего транспорта',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Свидетельство о прохождении проверки знаний «Правил плавания по ВВП РФ»',
            to: '/captainsService/sert/test.pdf',
          }},
        {h4: 'Нормативные правовые акты Российской Федерации'},
        {fileLink: {
            name: 'Федеральный закон от 07.03.2001 № 24-ФЗ «Кодекс внутреннего водного транспорта Российской Федерации»',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Министерства транспорта Российской Федерации от 12 марта 2018 г. № 87 «Об утверждении Положении о дипломировании членов экипажей судов внутреннего водного транспорта»',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ  Министерства транспорта Российской Федерации от 11 сентября 2013 г. № 287 «Об утверждении правил разработки и применения системы управления безопасностью судов»',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Постановление Правительства Российской Федерации от 12 августа 2010  г. № 623 «Об утверждении технического регламента о безопасности объектов внутреннего водного транспорта»',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтруда и социальной защиты России от 05.06.2014 N 367н по охране труда на судах морского и речного флота',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Минтранса РФ от 24.12.2002 г. № 158 ППБ ВВТ',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Наставление по борьбе за живучесть судов',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Министерства транспорта РФ от 19.01.2018 г. № 19 «Об утверждении правил плавания судов по внутренним водным путям»',
            to: '/captainsService/sert/test.pdf',
          }},
        {plink: [
            {
              before: '',
              link: {
                name: 'Организация дипломирования',
                to: '/captainsService/sert/test.pdf',
              },
              after: '',
            }
          ]},
        {plink: [
            {
              before: '',
              link: {
                name: 'Основания для возврата документов',
                to: '/captainsService/sert/test.pdf',
              },
              after: '',
            }
          ]},
        {plink: [
            {
              before: '',
              link: {
                name: 'Порядок обжалования решений',
                to: '/captainsService/sert/test.pdf',
              },
              after: '',
            }
          ]},
        {h4: 'Квалификационные испытания проводятся:'},
        {ul: [
          'при первичном получении квалификационного документа;',
          'при получении диплома в случае повышения в должности;',
          'при получении диплома при истечении срока действия диплома, и отсутствии необходимого стажа плавания;',
          'при первичном получении диплома лицами, имеющими военно-морское образование;',
          'при получении диплома судоводителя маломерного судна, используемого в коммерческих целях;',
          'при получении диплома судоводителя прогулочного судна.',
          ]},
        {h4: 'Оформление квалификационных документов без квалификационных испытаний:'},
        {ul: [
          'выпускникам образовательных организаций, осуществляющих подготовку специалистов для работы в составе экипажей судов внутреннего водного транспорта, в течение одного года после окончания обучения;',
          'получение нового квалификационного документа в целях снятия ограничений, обмена;',
          'получение нового квалификационного документа в случае утери или повреждения;',
          'получении диплома по той же должности после окончания срока действия диплома и при наличии стажа плавания;',
          ]},
        {plink: [
            {
              before: '',
              link: {
                name: 'Блок-схема предоставления услуги',
                to: '/captainsService/sert/test.pdf',
              },
              after: '',
            }
          ]},
        {h4: 'К прохождению квалификационных испытаний допускаются лица, не моложе 18 лет, предоставившие в комиссию не менее чем за 10 дней до заседания следующие документы:'},
        {fileLink: {
            name: '1. Для получения квалификационного свидетельства',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '2. Для  получения диплома старшего помощника капитана',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '3. Для получения диплома капитана',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '4. Для получения диплома первого помощника механика',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '5. Для получения диплома механика',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '6. Для получения диплома старшего помощника капитана – первого помощника механика',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '7. Для получения диплома капитана-механика',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '8. Для получения диплома первого помощника командира земснаряда',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '9. Для получения диплома командира земснаряда',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '10. Для получения диплома первого помощника командира земснаряда – первого помощника механика',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '11. Для получения диплома командира земснаряда – механика',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '12. Для получения диплома первого помощника электромеханика',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '13. Для получения диплома электромеханика',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '14. Для получения диплома начальника радиостанции',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '15. Для получения диплома члена экипажа скоростного судна',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '16. Для получения диплома судоводителя маломерного судна, используемого в коммерческих целях или судоводителя прогулочного судна',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '17. Для получения диплома лицами, имеющими военно-морское образование',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '18. Для получения диплома при истечении срока действия диплома и отсутствии необходимого стажа плавания',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '19. Для получения диплома студентами заочной формы обучения высших образовательных организаций',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '20. Для получения первичного диплома',
            to: '/captainsService/sert/test.pdf',
          }},
        {h4: ''},
        {fileLink: {
            name: '1. Для получения диплома выпускниками образовательных организаций в течение одного года после окончания учебы.',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '2. Для получения нового квалификационного документа в целях снятия ограничений, в случае утери, повреждения, перемены фамилии, имени или отчества.',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '3. Для получения диплома при истечении срока действия диплома и наличии необходимого стажа плавания.',
            to: '/captainsService/sert/test.pdf',
          }},
        {h4: 'Проверка знаний Правил Плавания судов по ВВП'},
        {fileLink: {
            name: '1. Перечень документов для прохождения проверки знаний ПП судов по ВВП',
            to: '/captainsService/sert/test.pdf',
          }},
        {h4: 'Бланки и примеры заполнения'},
        {fileLink: {
            name: '1. Согласие на обработку персональных данных',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '2. Заявление на прохождение квалификационных испытаний на получение квалификационного свидетельства',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '3. Заявление на прохождение квалификационных испытаний на получение диплома',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '4. Заявление на получение диплома без квалификационных испытаний',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '5. Заявление на получение квалификационного документа в целях снятия ограничений, в случае утери, повреждения, перемены фамилии, имени или отчества.',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '6. Заявление на проверку знаний ПП судов по ВВП',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '7. Образец заявления на получение квалификационного документа в целях снятия ограничений, в случае утери, повреждения, перемены фамилии, имени или отчества.',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '8. Справка о стаже плавания',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '9. Пример заполнения справки о стаже плавания',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '10. Доверенность на подачу документов',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '11. Пример заполнения доверенности на подачу документов',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '12. Доверенность на получение документов',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: '13. Пример заполнения доверенности на получение документов',
            to: '/captainsService/sert/test.pdf',
          }},
        {h4: 'Процедура проведения квалификационных испытаний'},
        {p: 'При дипломировании членов экипажей судов внутреннего водного транспорта предусматривается два этапа квалификационных испытаний.'},
        {p: 'На первом этапе кандидаты проходят письменное или компьютерное тестирование по перечню вопросов, разработанных АБВВП, согласованных Росморречфлотом.'},
        {p: 'Для тестирования кандидату предлагается 12 вопросов.'},
        {p: 'В случае получения правильных ответов на девять или более вопросов кандидат считается успешно прошедшим квалификационные испытания и прохождение второго этапа квалификационных испытаний не требуется.'},
        {p: 'На втором этапе комиссией проводится устное собеседование, на котором кандидату предлагается ответить на вопросы, на которые были получены неправильные ответы при письменном или компьютерном тестировании.'},
        {p: 'По результатам квалификационных испытаний комиссия принимает решение о соответствии кандидата должности, на которую он претендует'},
        {p: 'Кандидат участвует в квалификационных испытаниях непосредственно.'},
        {p: 'Решение о соответствии кандидата должности, на которую он претендует, принимается на заседании комиссии открытым голосованием простым большинством голосов от общего числа членов, присутствующих на заседании комиссии. При равенстве голосов решение считается принятым в пользу кандидата.'},
        {p: 'На основании представленных документов и результатов квалификационного испытания комиссией составляется протокол и дается одна из следующих оценок:'},
        {ul: [
          'кандидат соответствует должности, на которую он претендует;',
          'кандидат не соответствует должности, на которую он претендует.',
          ]},
        {p: ''},
        {p: ''},
        {p: ''},
        {h4: ''},
        {plink: [
            {
              before: 'В соответствии с Положением о дипломировании членов экипажей судов внутреннего водного транспорта, утвержденным ',
              link: {
                name: 'приказом Минтранса России от 12 марта 2018 г. № 87 ',
                to: '/captainsService/sert/test.pdf',
              },
              after: 'Росморречфлотом разработаны и согласованы вопросы для подготовки и проведения квалификационных испытаний членов экипажей судов внутреннего водного плавания в администрациях басcейнов внутренних водных путей и их филиалов.',
            }
          ]},
        {fileLink: {
            name: 'перечень вопросов для подготовки',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'перечень вопросов, используемых при проведении компьютерноготестирования',
            to: '/captainsService/sert/test.pdf',
          }},
        {h4: 'Кандидат на получение аттестационного удостоверения должен представить в аттестационную комиссию следующие документы:'},
        {fileLink: {
            name: 'для прохождения аттестации по СУБ',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Справка "СУБ"',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'Аттестационный лист "СУБ"',
            to: '/captainsService/sert/test.pdf',
          }},
        {fileLink: {
            name: 'График проведения аттестаций по СУБ в 2020 году',
            to: '/captainsService/sert/test.pdf',
          }},
        {p: '(аттестация исполнительных руководителей и специалистов отменена с 22.05.2018 г.)'},
        {plink: [
            {
              before: '',
              link: {
                name: 'График проведения квалифкационных испытаний в 2020 году',
                to: '/captainsService/sert/test.pdf',
              },
              after: '',
            }
          ]},
        {h4: 'Прием документов'},
        {pbr: [
            'Понедельник - четверг',
            '08:30 - 16:30, перерыв: 12:30 - 13:30',
          ]},
        {h4: 'Выдача документов'},
        {pbr: [
            'Понедельник - четверг',
            '08:30 - 17:00, перерыв: 12:30 - 13:30',
          ]},
        {pbr: [
            'Пятница',
            '08:30 - 12:30',
          ]},
        {h4: 'Проведение квалификационных испытаний'},
        {pbr: [
            'Понедельник - четверг',
            '09:00 - 15:00, перерыв: 12:30 - 13:30',
          ]},
        {h4: 'Проведение аттестации по СУБ'},
        {pbr: [
            'Среда',
            '09:00 - 15:00, перерыв: 12:30 - 13:30',
          ]},
        {h4: 'Контакты'},
        {pbr: [
            'Отдел дипломирования и аттестации',
            'Тел.: +7(499)638-42-01 доб. 666, 480, 481, 495',
            'E-mail: diplom@fgbu-kim.ru',
            'Адрес: г. Москва, Ленинградское шоссе, д. 53',
          ]},

      ]
    },
    shipRegistration: {
      page: 'shipRegistration',
      title: 'Государственная регистрация судов',
      content: [
        {p: 'Регистрация судов, прав на них и сделок с ними в Государственном судовом реестре, постановка на учет плавучих объектов, а также выдача свидетельств о минимальном составе экипажа самоходного транспортного судна внутреннего плавания в Московском бассейне внутренних водных путей возложена на Федеральное государственное бюджетное учреждение «Канал имени Москвы».'},
        {h4: 'Документы'},
        {fileLink: {
            name: 'Заявление – анкета для судов внутреннего плавания',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Заявление – анкета для спортивных парусных, прогулочных и маломерных судов',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Получение выписки из Государственного судового реестра РФ',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Извещение о присвоении названия судну',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Заявление на выдачу свидетельства о минимальном составе экипажа самоходного транспортного судна внутреннего плавания',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Заявление – анкета о постановке на учет плавучего объекта',
            to: '/captainsService/reg/test.pdf',
          }},
        {h4: 'Нормативные правовые акты Российской Федерации'},
        {fileLink: {
            name: 'Федеральный закон от 07.03.2001 № 24-ФЗ «Кодекс внутреннего водного транспорта Российской Федерации»',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Министерства транспорта Российской Федерации от 26.09.2001 № 144 «Об утверждении Правил государственной регистрации судов»',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Министерства транспорта Российской Федерации от 15.02.2017 № 52 «Об утверждении Порядка присвоения названия судам внутреннего водного транспорта»',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Министерства транспорта Российской Федерации от 22.10.2009 № 183 «Об утверждении Порядка государственной регистрации спортивных парусных судов и прав на них»',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Министерства транспорта Российской Федерации от 01.11.2002 № 138 «Об утверждении Положения о минимальном составе экипажей самоходных транспортных судов»',
            to: '/captainsService/reg/test.pdf',
          }},
        {fileLink: {
            name: 'Приказ Министерства транспорта Российской Федерации от 01.11.2017 № 470 «Об утверждении Правил учета плавучих объектов»',
            to: '/captainsService/reg/test.pdf',
          }},
        {h4: 'График приема документов'},
        {pbr: [
            'Понедельник, вторник, четверг, пятница',
            '08:30 - 12:30',
          ]},
        {pbr: [
            'Среда',
            'неприёмный день',
          ]},
        {h4: 'Выдача документов'},
        {p: 'Пн. - пт.: 08:30 - 17:00, перерыв: 12:30 - 13:30'},
        {h4: 'Контакты:'},
        {pbr: [
            'Отдел регистрации судов',
            'Тел.:  +7(495) 491-32-01, +7 (499) 638-42-01 доб. 661, 660, 618, 631',
            'E-mail: reg@fgbu-kim.ru',
            'Адрес: Москва, Ленинградское шоссе, д. 53, каб. 12, каб. 3',
          ]},
      ]
    },
    feeRefund: {
      page: 'feeRefund',
      title: 'Возврат государственной пошлины',
      content: [
        {h4: 'Основания и порядок возврата или зачета государственной пошлины'},
        {p: 'Статья 333.40. "Налогового кодекса Российской Федерации (часть вторая)" от 05.08.2000 N117-ФЗ (ред. от 15.04.2019)'},
        {p: '1. Уплаченная государственная пошлина подлежит возврату частично или полностью в случае:'},
        {p: '1) уплаты государственной пошлины в большем размере, чем это предусмотрено настоящей главой;'},
        {p: '2) возвращения заявления, жалобы или иного обращения или отказа в их принятии судами либо отказа в совершении нотариальных действий уполномоченными на то органами и (или) должностными лицами. Если государственная пошлина не возвращена, ее сумма засчитывается в счет уплаты государственной пошлины при повторном предъявлении иска, административного иска, если не истек трехгодичный срок со дня вынесения предыдущего решения и к повторному иску, административному иску приложен первоначальный документ об уплате государственной пошлины;'},
        {plink: [
            {
              before: '(пп. 2 в ред. Федерального ',
              link: {
                name: 'закона ',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_176156/3eeafbd3bdb64673818bd5cba64081209bddc7a4/#dst100110',
              },
              after: 'от 08.03.2015 N 23-ФЗ)',
            }
          ]},
        {p: '(см. текст в предыдущей редакции)'},
        {p: '3) прекращения производства по делу (административному делу) или оставления заявления (административного искового заявления) без рассмотрения Верховным Судом Российской Федерации, судами общей юрисдикции или арбитражными судами.'},
        {p: 'При заключении мирового соглашения до принятия решения Верховным Судом Российской Федерации, арбитражными судами возврату истцу подлежит 50 процентов суммы уплаченной им государственной пошлины. Данное положение не применяется в случае, если мировое соглашение заключено в процессе исполнения судебного акта.'},
        {p: 'Не подлежит возврату уплаченная государственная пошлина при добровольном удовлетворении ответчиком (административным ответчиком) требований истца (административного истца) после обращения указанных истцов в Верховный Суд Российской Федерации, арбитражный суд и вынесения определения о принятии искового заявления (административного искового заявления) к производству, а также при утверждении мирового соглашения, соглашения о примирении Верховным Судом Российской Федерации, судом общей юрисдикции;'},
        {plink: [
            {
              before: '(пп. 3 в ред. Федерального ',
              link: {
                name: 'закона ',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_176156/3eeafbd3bdb64673818bd5cba64081209bddc7a4/#dst100112',
              },
              after: 'от 08.03.2015 N 23-ФЗ)',
            }
          ]},
        {p: '(см. текст в предыдущей редакции)'},
        {p: '4) отказа лиц, уплативших государственную пошлину, от совершения юридически значимого действия до обращения в уполномоченный орган (к должностному лицу), совершающий (совершающему) данное юридически значимое действие;'},
        {p: '5) отказа в выдаче паспорта гражданина Российской Федерации для выезда из Российской Федерации и въезда в Российскую Федерацию, удостоверяющего в случаях, предусмотренных законодательством, личность гражданина Российской Федерации за пределами территории Российской Федерации и на территории Российской Федерации, проездного документа беженца;'},
        {plink: [
            {
              before: '6) направления заявителю уведомления о принятии его заявления об отзыве заявки на государственную регистрацию программы для ЭВМ, базы данных и топологии интегральной микросхемы до даты регистрации (в отношении государственной пошлины, предусмотренной ',
              link: {
                name: 'пунктом 1 статьи 330.30 ',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_28165/2401c8f5ae279ddb026b3249beb2198a5b59a78f/#dst5226',
              },
              after: 'настоящего Кодекса).',
            }
          ]},
        {plink: [
            {
              before: '(пп. 6 в ред. Федерального ',
              link: {
                name: 'законом',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_95507/b004fed0b70d0f223e4a81f8ad6cd92af90a7e3b/#dst100461',
              },
              after: ' от 27.12.2009 N 374-ФЗ)',
            }
          ]},
        {p: '2. Не подлежит возврату государственная пошлина, уплаченная за государственную регистрацию заключения брака, расторжения брака, перемены имени, внесение исправлений и (или) изменений в записи актов гражданского состояния, в случае, если впоследствии не была произведена государственная регистрация соответствующего акта гражданского состояния или не были внесены исправления и изменения в записи актов гражданского состояния.'},
        {plink: [
            {
              before: '(в ред. Федерального ',
              link: {
                name: 'закона',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_95507/b004fed0b70d0f223e4a81f8ad6cd92af90a7e3b/#dst100463',
              },
              after: ' от 27.12.2009 N 374-ФЗ)',
            }
          ]},
        {p: '(см. текст в предыдущей редакции)'},
        {p: '3. Заявление о возврате излишне уплаченной (взысканной) суммы государственной пошлины подается плательщиком государственной пошлины в орган (должностному лицу), уполномоченный совершать юридически значимые действия, за которые уплачена (взыскана) государственная пошлина.'},
        {p: 'К заявлению о возврате излишне уплаченной (взысканной) суммы государственной пошлины прилагаются подлинные платежные документы в случае, если государственная пошлина подлежит возврату в полном размере, а в случае, если она подлежит возврату частично, - копии указанных платежных документов.'},
        {p: 'Решение о возврате плательщику излишне уплаченной (взысканной) суммы государственной пошлины принимает орган (должностное лицо), осуществляющий действия, за которые уплачена (взыскана) государственная пошлина.'},
        {p: 'Возврат излишне уплаченной (взысканной) суммы государственной пошлины осуществляется органом Федерального казначейства.'},
        {p: 'Заявление о возврате излишне уплаченной (взысканной) суммы государственной пошлины по делам, рассматриваемым в судах, а также мировыми судьями, подается плательщиком государственной пошлины в налоговый орган по месту нахождения суда, в котором рассматривалось дело.'},
        {p: 'К заявлению о возврате излишне уплаченной (взысканной) суммы государственной пошлины по делам, рассматриваемым судами общей юрисдикции, арбитражными судами, Верховным Судом Российской Федерации, Конституционным Судом Российской Федерации и конституционными (уставными) судами субъектов Российской Федерации, мировыми судьями, прилагаются решения, определения или справки судов об обстоятельствах, являющихся основанием для полного или частичного возврата излишне уплаченной (взысканной) суммы государственной пошлины, а также подлинные платежные документы в случае, если государственная пошлина подлежит возврату в полном размере, а в случае, если она подлежит возврату частично, - копии указанных платежных документов.'},
        {plink: [
            {
              before: '(в ред. Федерального закона от 28.06.2014 ',
              link: {
                name: 'N 198-ФЗ',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_164867/b004fed0b70d0f223e4a81f8ad6cd92af90a7e3b/#dst100095',
              },
              after: ')',
            }
          ]},
        {plink: [
            {
              before: '(в ред. Федерального закона от 30.11.2016 ',
              link: {
                name: 'N 401-ФЗ',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_207915/b004fed0b70d0f223e4a81f8ad6cd92af90a7e3b/#dst100461',
              },
              after: ')',
            }
          ]},
        {p: '(см. текст в предыдущей редакции)'},
        {p: 'Заявление о возврате излишне уплаченной (взысканной) суммы государственной пошлины может быть подано в течение трех лет со дня уплаты указанной суммы.'},
        {p: 'Возврат излишне уплаченной (взысканной) суммы государственной пошлины производится в течение одного месяца со дня подачи указанного заявления о возврате.'},
        {plink: [
            {
              before: '(в ред. Федерального ',
              link: {
                name: 'закона',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_61787/b004fed0b70d0f223e4a81f8ad6cd92af90a7e3b/#dst101060',
              },
              after: ' от 27.07.2006 N 137-ФЗ)',
            }
          ]},
        {p: '(см. текст в предыдущей редакции)'},
        {plink: [
            {
              before: '(в ред. Федерального ',
              link: {
                name: 'закона',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_179089/3d0cac60971a511280cbba229d9b6329c07731f7/#dst100083',
              },
              after: ' от 31.12.2005 N 201-ФЗ)',
            }
          ]},
        {p: '(см. текст в предыдущей редакции)'},
        {p: '4. Не подлежит возврату государственная пошлина, уплаченная за государственную регистрацию прав, ограничений (обременений) прав на недвижимое имущество, сделок с ним, в случае отказа в государственной регистрации.'},
        {p: 'При прекращении государственной регистрации права, ограничения (обременения) права на недвижимое имущество, сделки с ним на основании соответствующих заявлений сторон договора возвращается половина уплаченной государственной пошлины'},
        {plink: [
            {
              before: '5. Утратил силу с 1 января 2007 года. - Федеральный ',
              link: {
                name: 'закон',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_201054/b004fed0b70d0f223e4a81f8ad6cd92af90a7e3b/#dst101061',
              },
              after: ' от 27.07.2006 N 137-ФЗ.',
            }
          ]},
        {p: '(см. текст в предыдущей редакции)'},
        {p: '6. Плательщик государственной пошлины имеет право на зачет излишне уплаченной (взысканной) суммы государственной пошлины в счет суммы государственной пошлины, подлежащей уплате за совершение аналогичного действия.'},
        {p: 'Указанный зачет производится по заявлению плательщика, предъявленному в уполномоченный орган (должностному лицу), в который (к которому) он обращался за совершением юридически значимого действия. Заявление о зачете суммы излишне уплаченной (взысканной) государственной пошлины может быть подано в течение трех лет со дня принятия соответствующего решения суда о возврате государственной пошлины из бюджета или со дня уплаты этой суммы в бюджет. К заявлению о зачете суммы излишне уплаченной (взысканной) государственной пошлины прилагаются: решения, определения и справки судов, органов и (или) должностных лиц, осуществляющих действия, за которые уплачивается государственная пошлина, об обстоятельствах, являющихся основанием для полного возврата государственной пошлины, а также платежные поручения или квитанции с подлинной отметкой банка, подтверждающие уплату государственной пошлины.'},
        {p: '7. Возврат или зачет излишне уплаченных (взысканных) сумм государственной пошлины производится в порядке, установленном главой 12настоящего Кодекса.'},
        {plink: [
            {
              before: '7.1. Плательщик государственной пошлины, установленной в соответствии с ',
              link: {
                name: 'подпунктом 94 пункта 1 статьи 333.33',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_322596/7f6aa2a30ed6c4b39a5890e07c7494d9c278b8ea/#dst13069',
              },
              after: ' настоящего Кодекса, ',
            },
            {
              before: 'за исключением государственной пошлины, уплаченной за предоставление или продление срока действия лицензии на розничную продажу алкогольной продукции, имеет право на зачет уплаченной суммы государственной пошлины в счет суммы государственной пошлины, подлежащей уплате за совершение аналогичного действия. Указанный зачет производится в случае, если уполномоченным органом было отказано в совершении юридически значимого действия по основаниям, указанным в ',
              link: {
                name: 'пункте 9 статьи 19',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_314829/c5ddab697f05375d97c01e12646f730915e62d13/#dst100493',
              },
              after: ' Федерального закона от 22 ноября 1995 года N 171-ФЗ "О государственном регулировании производства и оборота этилового спирта, алкогольной и спиртосодержащей продукции и об ограничении потребления (распития) алкогольной продукции".',
            }
          ]},
        {plink: [
            {
              before: 'Зачет суммы уплаченной государственной пошлины осуществляется на основании заявления в письменной форме (заявления, представленного в электронной форме с усиленной квалифицированной электронной подписью по телекоммуникационным каналам связи) плательщика. ',
              link: {
                name: 'Форма ',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_320315/a525f91c3dd1409a35ac7522db11bda59b6aef28/#dst100013',
              },
              after: 'и формат указанного заявления утверждаются федеральным органом исполнительной власти, осуществляющим функции по контролю за производством и оборотом этилового спирта, алкогольной и спиртосодержащей продукции, по надзору и оказанию услуг в этой сфере.',
            }
          ]},
        {p: 'Зачет суммы уплаченной государственной пошлины может быть осуществлен в течение трех лет со дня ее уплаты.'},
        {plink: [
            {
              before: '(п. 7.1 введен Федеральным ',
              link: {
                name: 'законом ',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_312040/3d0cac60971a511280cbba229d9b6329c07731f7/#dst100449',
              },
              after: 'от 03.08.2018 N 301-ФЗ)',
            }
          ]},
        {p: '8. Не подлежит возврату государственная пошлина, уплаченная за совершение действий по опробованию, анализу и клеймению ювелирных и других изделий из драгоценных металлов, в случае возврата таких изделий в неклейменом виде по основаниям, предусмотренным законодательством Российской Федерации.'},
        {plink: [
            {
              before: '(п. 8 введен Федеральным ',
              link: {
                name: 'законом ',
                to: 'http://www.consultant.ru/document/cons_doc_LAW_178854/3d0cac60971a511280cbba229d9b6329c07731f7/#dst100033',
              },
              after: 'от 02.05.2015 N 112-ФЗ)',
            }
          ]},
        {h4: 'Возврат госпошлины осуществляется:'},
        {ul: [
          'по заявлению плательщика;',
          'при наличии подлинных платежных документов;',
          'непосредственно плательщику;',
          'на расчетный счет карты или сберегательной книжки;',
          'на рублевый расчетный счет;',
          'частично или в полном объеме;',
          'при наличии письма от ФБУ или ФГБУ (организации, где проводилась регистрация судна, дипломирование, оформление УЛМ) о юридически значимых действиях по платежным документам, предоставленным на возврат госпошлины;',
          'через банки, находящиеся на территории РФ.',
          ]},
        {h4: 'Возврат госпошлины не осуществляется:'},
        {ul: [
          'при отсутствии подлинных платежных документов;',
          'на расчетные счета близких родственников или друзей;',
          'на номер карты;',
          'на валютный расчетный счет;',
          'возврату не подлежит комиссия банка за перевод госпошлины;',
          'по истечении трех лет с момента оплаты госпошлины;',
          'не прошедшим квалификационные испытания (дипломирование);',
          'при отказе в регистрационных действиях согласно Приказу №144 от 26.09.2001 г. «Об утверждении Правил государственной регистрации судов».',
          ]},
        {h4: 'Заключение или письмо о юридически значимых действия должно содержать:'},
        {ul: [
          'причину возврата госпошлины;',
          'наименование плательщика;',
          'наименование платежного документа (чек-ордер, платежное поручение);',
          'номер  платежного документа или № операции (чек-ордер);',
          'дату платежного документа;',
          'сумму, подлежащую возврату.',
          ]},
        {p: 'Заключение на возврат госпошлины направляется на имя Руководителя ФКУ «Речводпуть». К заключению необходимо предоставить:'},
        {ul: [
          'подлинный платежный документ (если госпошлина подлежит возврату в полном объеме) или копию платежного документа (если госпошлина подлежит возврату частично);',
          'подлинное заявление на возврат госпошлины плательщика.',
          ]},
        {h4: 'Форма заявления на возврат государственной пошлины'},
        {fileLink: {
            name: 'для физических лиц',
            to: '/captainsService/fee/test.pdf',
          }},
        {fileLink: {
            name: 'для юридических лиц',
            to: '/captainsService/fee/test.pdf',
          }},
        {h4: 'Форма заявлений на изменение КБК'},
        {fileLink: {
            name: 'для физических лиц',
            to: '/captainsService/fee/test.pdf',
          }},
        {fileLink: {
            name: 'для юридических лиц',
            to: '/captainsService/fee/test.pdf',
          }},

      ]
    },
  }

  const menu = menuData
  const data = pagesData[ctx.params.pageName]

  return { props: {data, ctx ,menu}}
}

export const getStaticPaths = async () => {
  return {
    fallback: false,
    paths: [
      { params: {pageName: 'portControl'}},
      { params: {pageName: 'seaPass'}},
      { params: {pageName: 'certification'}},
      { params: {pageName: 'shipRegistration'}},
      { params: {pageName: 'feeRefund'}},
    ]
  }
}

export default DocumentsPages