import React from 'react'
import {menu as menuData} from '../../assets/menu'
import {makeContent} from '../../utils/makeContent'
import {Footer, Head, Header, InnerPage} from '../../modules';


const AboutPages = (props) => {

  const pageContent = makeContent(props.data.content)

  // const pageContent = props.data.content.map((item, index) => {
  //   switch (Object.keys(item)[0]) {
  //     case 'p':
  //       return (<p key={index}>{item.p}</p>)
  //     case 'ul':
  //       return (
  //         <ul key={index}>
  //           {item.ul.map((item, index) => (<li key={index}>{item}</li>))}
  //         </ul>
  //       )
  //     case 'structureBlock':
  //       return ( <StructureBlock data={item.structureBlock} key={index}/> )
  //     case 'infoBlock':
  //       return ( <InfoBlock data={item.infoBlock} key={index}/> )
  //     case 'slider':
  //       return ( <ContentSlider images={item.slider} key={index}/>)
  //     case 'h4':
  //       return ( <h4 key={index}>{item.h4}</h4>)
  //     case 'h3':
  //       return ( <h3 key={index}>{item.h3}</h3>)
  //     case 'h4center':
  //       return ( <h4 key={index} style={{textAlign: 'center'}}>{item.h4center}</h4>)
  //     case 'plink':
  //       return ( <PLink data={item.plink} key={index}/>)
  //     case 'pbr':
  //       return (
  //         <p key={index + 400}>{item.pbr.map((item, index) => (<React.Fragment key={index + 300}>{item} <br/></React.Fragment>))}</p>)
  //     case 'line':
  //       return ( <span key={index} className='page__content-line'/>)
  //     case 'faqForm':
  //       return ( <FaqForm key={index}/> )
  //   }
  // })

  // return (
  //   <div className='container'>
  //     <Head/>
  //     <Header menu={props.menu}/>
  //     <main className='u-pt-mid'>
  //       <div className='content'>
  //         <div className='page'>
  //           <Sidebar className='page__sidebar' menu={props.menu[0].subItems} title={props.menu[0].title}/>
  //           <div className='page__content'>
  //             <h1 className='content__title'>
  //               {props.data.title}
  //             </h1>
  //             {pageContent}
  //           </div>
  //         </div>
  //       </div>
  //     </main>
  //     <Footer/>
  //   </div>
  // )

  return (
    <div className='container'>
      <Head/>
      <Header menu={props.menu}/>
      <InnerPage menu={props.menu} sidebar={0} title={props.data.title} pageContent={pageContent}/>
      <Footer/>
    </div>

    )
}

export const getStaticProps = async (ctx) => {

  const pagesData = {
    about: {
      page: 'about',
      title: 'Общая информация',
      content: [
        {p: 'Федеральное государственное бюджетное учреждение «Канал имени Москвы» ' +
            'является крупнейшим воднотранспортным и водохозяйственным комплексом, ' +
            'выполняет функции органа государственного управления в Московском ' +
            'бассейне внутренних водных путей.'},
        {p: 'ФГБУ «Канал имени Москвы» – это 12 субъектов РФ (Москва, Подмосковье, ' +
            'Тульская, Тверская, Вологодская, Ярославская, Новгородская, Рязанская, ' +
            'Владимирская, Калужская, Нижегородская и Ивановская области), 3842 км ' +
            'внутренних водных путей, в том числе 88 км по Москве и 484 км – по Московской ' +
            'области. Вместе они формируют Московский бассейн, который включает в себя 50 ' +
            'судоходных артерий, в том числе реки Волга, Молога, Созь, Шоша, Тверца, Донховка, ' +
            'Сосца, Дубна, Кимрка, Хотча, Медведица, Нерль, Большая и Малая Пудица, Кашинка, ' +
            'Жабня, Пукша, Мимошня, Скоморошка, Нара, Клязьма, Проня, Трубеж, Мокша, Цна, Ухра, ' +
            'Сить, Юхоть, Согожа, Кондоша, Сутка, Москва, Ока, а также «Канал имени Москвы», ' +
            'канал Липня, Старица Черный Яр, Киструсская Старица, Юштинский ключ, Старица Белое ' +
            'озеро, озеро Селигер и Рыбинское, Клязьминское, Пяловское, Пестовское, Верхневолжское,' +
            ' Мстинское, Вышневолоцкое, Иваньковское, Угличское водохранилище.'},
        {p: 'ФГБУ «Канал имени Москвы» имеет десять филиалов: Рыбинский, Тверской, Волжский, ' +
            'Яхромский, Тушинский, Московский и Рязанский районы гидротехнических сооружений ' +
            '(РГС), Серпуховский и Муромский районы водных путей (РВП), а также Дмитровские ' +
            'электрические сети (ДЭС).'},
        {p: '«Канал имени Москвы» как искусственное русло является уникальным гидротехническим ' +
            'сооружением – единственным в мире по своему инженерному исполнению, размерам и мощностям. ' +
            'Протяженность рукотворного русла составляет 128 км. Начинается он от Иваньковского ' +
            'водохранилища (в районе г. Дубны), где находятся шлюз №1 и Иваньковская ГЭС, а ' +
            'заканчивается в месте соединения с Москвой-рекой в районе Щукино. Трудные условия ' +
            'рельефа и проходящая между Москвой и Волгой значительная возвышенность не позволяли ' +
            'сделать канал самотечным, а только шлюзованным, с механической подачей воды. Таким ' +
            'образом «Канал имени Москвы» построен в виде лестницы с гигантскими водяными ступенями, ' +
            'ограниченными шлюзами. Шлюзы пропускают суда при переходе с более низкого уровня на ' +
            'более высокий и наоборот. Для перекачки воды с одной ступени на другую устроены насосные ' +
            'станции, которые поднимают ее на высоту 38 м.'},
        {p: 'Инфраструктуру «Канала» формируют пять насосных станций суммарной мощностью 100 мегаватт ' +
            '(перекачивают около 1,5 млрд куб. м воды в год), семь гидроэлектростанций суммарной ' +
            'мощностью 66 мегаватт (эти ГЭС ежегодно могут вырабатывать 215 млн киловатт-часов энергии), ' +
            '20 шлюзов, а также плотины, каналы, причалы и другие гидротехнические сооружения.'},
        {p: 'Флот ФГБУ «Канал имени Москвы» формируют земкараваны с черпаковыми земснарядами и ' +
            'землесосами, мотозавозни, шаланды, брандвахты, дноочистительные снаряды и плавкраны, ' +
            'а также самоходный флот, который включает в себя буксиры, танкеры и обстановочные суда.'},
        {p: '«Канал имени Москвы» решает важные водно-хозяйственные задачи:'},
        {ul: [
          'содержание внутренних водных путей и судоходных гидротехнических сооружений;',
          'обеспечение безопасности судоходства;',
          'санитарное обводнение Москвы-реки и ее притоков;',
          'водоснабжение города Москвы;',
          'выработка и передача электроэнергии;',
          'развитие рекреационно-туристической инфраструктуры.',
          ]},
        {p: 'С 2012 года в Московском бассейне внутренних водных путей начал действовать государственный ' +
            'портовый контроль. В ведении ФГБУ «Канал имени Москвы» находится государственная регистрация ' +
            'судов, оформление удостоверения личности моряка (УЛМ) и мореходной книжки, дипломирование ' +
            'членов экипажей морских судов, судов внутреннего плавания и спортивных парусных лодок.'},
        {p: 'ФГБУ «Канал имени Москвы» является важнейшей магистралью водного транспорта в центральном ' +
            'регионе, соединяющей Москву и Московскую область с крупными экономическими районами ' +
            'Европейской части России. «Канал» отнесен к категории стратегически важных объектов РФ, ' +
            'а ряд его гидротехнических сооружений включены в Перечень критически важных объектов РФ.'},
        {p: 'Сегодня ФГБУ «Канал имени Москвы» занимается комплексной модернизацией и перевооружением ' +
            'гидротехнических сооружений и объектов инфраструктуры. Это позволит раскрыть и увеличить ' +
            'имеющийся потенциал «Канала», обусловленный уникальной инфраструктурой, географией, ' +
            'размерами и стратегическим значением для страны.'},
      ]
    },
    structure: {
      page: 'structure',
      title: 'Структура и руководство',
      content: [
        {structureBlock: {
          title: 'Руководство',
          phone: '',
          content: [
            {
              name: 'ЛАПШИН Сергей Борисович',
              position: 'Руководитель',
              phone: '+7 (499) 638-42-01 доб. 625'
            },
            {
              name: 'НЕМКОВ Алексей Николаевич',
              position: 'Первый заместитель руководителя',
              phone: '+7 (499) 638-42-01 доб. 469'
            },
            {
              name: 'ШТУРМИН Владимир Вячеславович',
              position: 'Первый заместитель руководителя - капитан Московского бассейна внутренних водных путей',
              phone: '+7 (499) 642-84-33'
            },
            {
              name: 'ИРИСХАНОВ Сергей Алиевич',
              position: 'Заместитель руководителя по экономике и финансам',
              phone: '+7 (499) 638-42-01 доб. 775'
            },
            {
              name: 'КАСАТКИН Александр Александрович',
              position: 'Заместитель руководителя по инвестициям и развитию',
              phone: '+7 (499) 638-42-01 доб. 994'
            },
            {
              name: 'САРАФАНОВ Александр Геннадьевич',
              position: 'Заместитель руководителя по безопасности',
              phone: '+7 (499) 638-42-01 доб. 785'
            },
            {
              name: 'ШУСТОВА Мария Владимировна',
              position: 'Заместитель руководителя по правовым и имущественным вопросам',
              phone: '+7 (499) 638-42-01 доб. 419'
            },
            {
              name: 'АНДРОСОВ Андрей Валерьевич',
              position: 'Главный инженер',
              phone: '+7 (499) 638-42-01 доб. 757'
            },
            {
              name: 'МАРТИШКИНА Наталия Сергеевна',
              position: 'Главный бухгалтер',
              phone: '+7 (499) 638-42-01 доб. 935'
            },
            ]
          }},
        {structureBlock: {
            title: 'Административная служба',
            phone: '+7 (495) 491-26-57',
            content: [
              {
                name: 'Жукова Елена Витальевна',
                position: 'Начальник службы',
                phone: '+7 (499) 638-42-01 доб. 470'
              },
            ]
          }},
        {structureBlock: {
            title: 'Пресс-служба',
            phone: '+7 (495) 491-32-57',
            content: [
              {
                name: 'Хрустова Наталья Владимировна',
                position: 'Начальник службы',
                phone: '+7 (499) 638-42-01 доб. 770'
              },
              {
                name: 'Князева Анна Юрьевна',
                position: 'Зам. начальника службы',
                phone: '+7 (499) 638-42-01 доб. 673'
              },
            ]
          }},
      ]
      },
    branches: {
      page: 'branches',
      title: 'Филиалы',
      content: [
        {infoBlock : {
          link: {
            name: 'Рыбинский район гидротехнических сооружений',
            to: '/'
          }
          }},
        {infoBlock : {
            link: {
              name: 'Тверской район гидротехнических сооружений',
              to: '/'
            }
          }},
        {infoBlock : {
            link: {
              name: 'Волжский район гидротехнических сооружений',
              to: '/'
            }
          }},
        {infoBlock : {
            link: {
              name: 'Дмитровские электрические сети',
              to: '/'
            }
          }},
        {infoBlock : {
            link: {
              name: 'Яхромский район гидротехнических сооружений',
              to: '/'
            }
          }},
        {infoBlock : {
            link: {
              name: 'Тушинский район гидротехнических сооружений',
              to: '/'
            }
          }},
        {infoBlock : {
            link: {
              name: 'Московский район гидротехнических сооружений',
              to: '/'
            }
          }},
        {infoBlock : {
            link: {
              name: 'Рязанский район гидротехнических сооружений',
              to: '/'
            }
          }},
        {infoBlock : {
            link: {
              name: 'Серпуховский район водных путей',
              to: '/'
            }
          }},
        {infoBlock : {
            link: {
              name: 'Муромский район водных путей',
              to: '/'
            }
          }},
      ]
    },
    history: {
      page: 'history',
      title: 'История',
      content: [
        {h4: 'Предпосылки развития'},
        {p: 'В начале 1930-х годов проблема обеспечения Москвы водой стояла очень остро. ' +
            'Город стремительно рос, благоустраивался, развивалась его промышленность. Нужен ' +
            'был новый источник, который обеспечивал бы столицу питьевой водой, давал воду для ' +
            'судоходства и улучшения санитарного состояния Москвы-реки и ее притоков. Таким источником ' +
            'воды стала Волга.'},
        {p: '15 июня 1931 года Пленум ЦК ВКП (б) постановил: «...коренным образом разрешить задачу обводнения ' +
            'Москвы-реки путем соединения ее с верховьем реки Волги». Для определения оптимального пути ' +
            'соединения двух рек были проведены значительные изыскательские работы. В результате были ' +
            'разработаны несколько вариантов: Старицкий, Шошинский и Дмитровский.'},
        {p: 'Старицкий вариант предусматривал подачу воды в Москву по самотечному каналу длиной 230 км. ' +
            'В этом случае не требовались ни насосные станции, ни шлюзы. Но этот, на первый взгляд, ' +
            'заманчивый вариант не решал полностью задач обводнения столицы, был колоссальным по объему ' +
            'земляных работ. Кроме того, вода могла прорваться в карстовые пустоты, которых много в районе ' +
            'Старицы, уйти под землю, а песчаные грунты на трассе будущего канала грозили большими оползнями.'},
        {p: 'В Шошинском варианте канал брал свое начало у впадения реки Шоши в Волгу. Для обеспечения ' +
            'нужного профиля требовался механический подъем воды на 71 м, а для судоходства – устройство шлюзов.'},
        {p: 'В Дмитровском варианте трасса канала начиналась в месте впадения в Волгу реки Дубны. ' +
            'Отсюда канал, преодолевая на своем пути довольно значительный подъем пятью ступенями, ' +
            'направлялся на юг через Дмитров и Икшу. Каждая ступень представляла собой однокамерный шлюз ' +
            'и насосную станцию. Далее, дойдя до селения Пестово, расположенного при впадении реки Черной ' +
            'в реку Вязь, канал пересекал водораздел между реками Вязь и Уча и поворачивал на юго-запад. ' +
            'В этом направлении он прорезал Клязьминско-Химкинский водораздел и, пройдя далее долиной реки ' +
            'Химки, спускался по крутому склону к Москва-реке в районе селения Щукино.'},
        {p: 'Водохранилище в восточной части водораздельного участка канала было предусмотрено специальными ' +
            'плотинами разделить на два самостоятельных водохранилища: западное – судоходное, и восточное – ' +
            'отстойное, предназначенное для водоснабжения. От последнего прокладывался водопроводный канал ' +
            'для подачи питьевой воды в городскую водопроводную сеть через городские очистительные станции. ' +
            'От западной же части водохранилища судоходный канал шел на юг и спускался к реке Москве двумя ' +
            'двухкамерными шлюзами.'},
        {p: 'Благодаря устройству Иваньковского водохранилища с подъемом воды на 16 м уменьшилась высота ' +
            'накачки воды в канал, был обеспечен равномерный забор воды в необходимом количестве.'},
        {p: 'Геологические условия Дмитровского варианта, хотя и оказались весьма разнообразными, ' +
            'значительно усложнявшими как выбор отдельных участков канала, так и мест расположения его ' +
            'основных сооружений, в целом были более благоприятными, нежели условия других вариантов. ' +
            'Общая протяженность канала составляла 128 км.'},
        {slider: [
            {
              link: '/slider/content/history/1-1-min.jpg',
              title: '1932. Инженер Семёнов чертит трассу Канала'
            },
            {
              link: '/slider/content/history/1-2-min.jpg',
              title: '3 сентября 1932. Начальник Химкинского участка Марченко вынимает первый грунт из русла будущего канала'
            },
          ]},
        {h4: 'Строительство'},
        {p: '3 сентября 1932 года началась одна из грандиозных строек века. Предстояло в сжатые сроки преодолеть расстояние от села Тушина до устья реки Дубны, впадающей в Волгу. Высокий гребень холмов с истоками и долинами мелких рек должен был превратиться в многокилометровый «водяной мост» Волга-Москва. У деревни Иваньково, близ устья реки Дубны, Волгу перегородили огромной плотиной. Упираясь в плотину и разливаясь, вода должна была накапливаться в системе искусственных водохранилищ – Московском море. Часть воды должна была круто повернуть на юг, в русло «Канала» и дальше взбираться по «лестнице» вверх на высоту десятиэтажного дома, чтобы потом пройти по ровному и широкому участку и снова круто спуститься вниз по системе шлюзов к Москва-реке.'},
        {p: 'К весне 1937 года было вынуто 151,4 млн куб. м земли, 56 млн куб. м гравия, песка и глины. Уложено 3,11 млн куб. м бетона и железобетона. Почти 6,5 млн кв. м откосов «Канала» было укреплено камнем (это сопоставимо с размерами небольшой европейской страны). Для сооружения «Канала» потребовалось 35 тыс. тонн металлоконструкций, 2,35 млн куб. м лесоматериалов, 850 тыс. тонн цемента, около 7 млн куб. м камня и гравия, 110 млн штук кирпича. На стройке работали 170 экскаваторов, 1600 автомобилей, 275 тракторов, 150 паровозов, 225 мотовозов, 2113 железнодорожных платформ, 240 бетономешалок, 1100 электровибраторов, 5750 электромоторов. К трассе «Канала» было подведено свыше 600 км железных дорог, по которым можно было увезти почти 50 тыс. тонн груза.'},
        {p: 'Ранней весной 1937 года «Канал» был почти готов: к тому времени были прорезаны холмы, намыты высокие дамбы, воздвигнуты железобетонные коробки шлюзов. В отличие от других крупных гидротехнических строек «Канал имени Москвы» был запроектирован и построен силами советских инженеров без участия иностранных фирм и специалистов. Многие из созданных тогда гидротехнических сооружений до сих пор удивляют специалистов смелостью и оригинальностью инженерных решений.'},
        {p: 'Итак, за неполных пять лет было построено более 200 гидротехнических сооружений: 109 км судоходных каналов, 11 судоходных шлюзов, пять насосных станций, восемь гидроэлектростанций, три железобетонные плотины, восемь земляных дамб, 19 мостов и путепроводов, два транспортных тоннеля, восемь аварийных и заградительных ворот, одна водопроводная станция с каналами, 406 км линий электропередач и другие объекты и сооружения.'},
        {p: '23 марта 1937 года было принято решение «остановить Волгу», то есть приступить к наполнению Московского моря и самого «Канала». Одновременно с Волгой реки Икша, Уча и Клязьма заполнили своими водами громадные водоемы – будущее ложе «Канала». Через 13 дней специалисты доложили: «Московское море заполнено!». Волга покорена, ее вода взята на строгий учет.'},
        {p: 'К 17 апреля 1937 года вода наполнила все 128 км «Канала Москва-Волга». Работы, начатые в конце 1932 года, были выполнены за 4 года и 8 месяцев.'},
        {p: '2 мая 1937 года флотилия белоснежных теплоходов впервые прошла по шлюзам с верхней Волги в Северный речной порт и остановилась у Химкинского речного вокзала.'},
        {p: '15 июля 1937 года «Канал Москва-Волга» был торжественно открыт для движения пассажирских и грузовых судов.'},
        {p: 'Строительство «Канала», соединившего Волгу с рекой Москвой, комплексно разрешило все водохозяйственные проблемы Москвы на несколько десятилетий вперед. Опыт эксплуатации «Канала» полностью подтвердил правильность выбранного решения.'},
        {slider: [
            {
              link: '/slider/content/history/2-1-min.jpg',
              title: ''
            },
            {
              link: '/slider/content/history/2-2-min.jpg',
              title: '1932. Начало строительства Канала'
            },
            {
              link: '/slider/content/history/2-3-min.jpg',
              title: ''
            },
            {
              link: '/slider/content/history/2-4-min.jpg',
              title: '1935. Рабочие за снятием расширительного слоя'
            },
            {
              link: '/slider/content/history/2-5-min.jpg',
              title: '1935. Дмитров. Рабочие на мостике экскаватора Ковровец'
            },
            {
              link: '/slider/content/history/2-6-min.jpg',
              title: '1937. Шлюз №1. Первое шлюзование'
            },
            {
              link: '/slider/content/history/2-7-min.jpg',
              title: '22 апреля 1937. Ворошилов, Молотов, Сталин, Ежов во время осмотра Канала'
            },
            {
              link: '/slider/content/history/2-8-min.jpg',
              title: '1937. Канал Москва-Волга открыт для движения судов (коллаж в газете)'
            },
          ]},
        {h4: 'Военные годы'},
        {p: 'В 1941 году «Канал Москва-Волга» сыграл важную роль в защите столицы от немецко-фашистских ' +
            'захватчиков. Группой специалистов «Канала» (Д.Ф. Агафонов, Л.С. Кусков, Б.М. Фрадкин, А.А. ' +
            'Ярустовский, И.Н. Дымент, В.С. Жданов) было внесено предложение о создании дополнительной водной ' +
            'преграды врагу, используя гидротехнические сооружения. В конце ноября 1941 года немецкие части, ' +
            'продвигаясь от города Калинина в направлении Большой Волги, начали форсировать замерзшее ' +
            'Иваньковское водохранилище, двигаясь по достаточно прочному льду. Работники Иваньковской ГЭС ' +
            'начали интенсивный сброс воды через плотину. Уровень воды в водохранилище понизился на 2 м, ' +
            'лед стал оседать и ломаться. Войска и техника противника были вынуждены повернуть назад.'},
        {p: 'В этот же период немецкие войска начали наступление на участке Клин–Рогачево–Дмитров. Командующий ' +
            'Западным фронтом Г.К. Жуков отдал распоряжение о затоплении поймы рек Сестры и Яхромы. Несмотря ' +
            'на налеты вражеской авиации, к 1 декабря 1941 года был осуществлен сброс воды из «Канала» в реку ' +
            'Сестру через водосброс Сестринских сооружений. В результате интенсивного сброса воды в реки ' +
            'Яхрому и Сестру на пути гитлеровской армии был поставлен мощный водный заслон.'},
        {p: '«Канал» выполнил роль мощного оборонительного и напорного рубежа и тем самым вписал яркую ' +
            'страницу в историю победы советского народа в битве под Москвой. В память об этом на Перемиловских' +
            ' высотах под Дмитровом в 1966 году сооружен монумент воинской славы. Отсюда началось наступление ' +
            'наших войск в начале декабря 1941 года. Саперные специалисты инженерных войск при участии ' +
            'работников «Канала» превратили его в прочный оборонительный рубеж. Вдоль всего «Канала» были ' +
            'вырыты траншейные ходы и гнезда для установки пулеметов и малых орудий.'},
        {p: 'В годы Великой Отечественной войны «Канал» ни на один день не прекращал своей деятельности. ' +
            'Подавая тогда около 80% питьевой воды, он имел важное стратегическое значение для жизнедеятельности ' +
            'Москвы. Гидроэлектростанции «Канала» составляли существенную долю от мощности энергосистемы, ' +
            'помогая в энергоснабжении региона. По «Каналу» перевозились военные грузы.'},
        {p: 'В результате военных действий многие гидротехнические сооружения сильно пострадали. Для ' +
            'своевременной организации перевозок, улучшения водоснабжения и энергоснабжения предприятий ' +
            'Москвы и области Государственный Комитет Обороны вынес решение о восстановлении «Канала» и ' +
            'его пуске к навигации 1942 года.'},
        {p: '19 мая 1942 года было открыто сквозное движение по «Каналу».'},
        {p: 'В 1943 году было полностью завершено восстановление «Канала».'},
        {p: 'В 1947 году в честь 800-летия столицы «Канал Москва-Волга» был переименован в «Канал имени Москвы».'},
        {slider: [
            {
              link: '/slider/content/history/3-1-min.jpg',
              title: '28 ноября 1941. Немцы на левом берегу Канала'
            },
            {
              link: '/slider/content/history/3-2-min.jpg',
              title: '1941-1942. Взорванный шлюз №3'
            },
            {
              link: '/slider/content/history/3-3-min.jpg',
              title: '1941-1942. Взорванный шлюз №3'
            },
            {
              link: '/slider/content/history/3-4-min.jpg',
              title: '1941-1942. Разрушенный Яхромский мост'
            },
          ]},
      ]
    },
    museum: {
      page: 'museum',
      title: 'Музей',
      content: [
        {p: '5 июля 2007 года в административном здании Яхромского РГС, расположенном в поселке Деденево ' +
            'Дмитровского района, был открыт музей истории и современности Канала имени Москвы.'},
        {p: 'Музей создан по инициативе и при непосредственном участии администрации, трудовых коллективов ' +
            'и ветеранов ФГБУ «Канал имени Москвы».'},
        {p: 'Музей отражает историю Канала имени Москвы, начиная с 1932 года по настоящее время. ' +
            'Экспозиция посвящена проектированию, строительству, роли канала в разные годы, в том числе ' +
            'и в годы Великой Отечественной войны. Особое место занимают стенды, рассказывающие о людях, ' +
            'которые посвятили свою трудовую деятельность служению одному из лучших каналов мира. В ' +
            'экспозиции музея есть редкие архивные фотографии, документы, карты-схемы 1932-1937 годов, а ' +
            'также личный инструмент «каналоармейцев», найденный при ремонте стен камер шлюза. Некоторые ' +
            'экспонаты такого размера и веса, что место им нашлось только на улице, на открытой площадке. ' +
            'Это тяжеловесные и массивные стальные части агрегата, который качал воду в Москву.'},
        {p: 'Строительство канала Москва-Волга началось в сентябре 1932 года и длилось 4 года 8 месяцев. ' +
            'Ценой многих жизней досталась эта стройка. История создания канала вызывает чувство восхищения ' +
            'и преклонения перед людьми, претворившими в жизнь этот грандиозный комплекс сооружений. В ' +
            'память о строителях канала на берегу Канала имени Москвы при подходе к шлюзу №4 возведена ' +
            'часовня Новомучеников в земле российской просиявших. Первый камень часовни, выполненной по ' +
            'проекту художника Петра Стронского, был торжественно заложен 5 июля 2007 года, в день открытия ' +
            'музея.'},
        {p: 'Музей расположен по адресу: 141850, Московская область, Дмитровский район, п. Деденево, ' +
            'ул. Комсомольская, д. 27.'},
        {slider: [
            {
              link: '/slider/content/museum/1-1.jpg',
              title: ''
            },
            {
              link: '/slider/content/museum/1-2.jpg',
              title: ''
            },
            {
              link: '/slider/content/museum/1-3.jpg',
              title: ''
            },
            {
              link: '/slider/content/museum/1-4.jpg',
              title: ''
            },
            {
              link: '/slider/content/museum/1-5.jpg',
              title: ''
            },
            {
              link: '/slider/content/museum/1-6.jpg',
              title: ''
            },
            {
              link: '/slider/content/museum/1-7.jpg',
              title: ''
            },
            {
              link: '/slider/content/museum/1-8.jpg',
              title: ''
            },
            {
              link: '/slider/content/museum/1-9.jpg',
              title: ''
            },
          ]},
      ]
    },
    education: {
      page: 'education',
      title: 'Образование',
      content: [
        {h4center: 'Рязанский учебный комбинат ФГБУ «Канал имени Москвы»'},
        {plink: [
            {
              before: 'Федеральное государственное бюджетное учреждение «Канал имени Москвы» в ',
              link: {
                name: 'Рязанском районе гидротехнических сооружений ',
                to: '/'
              },
              after: 'располагает учебным комбинатом по подготовке командного и рядового плавающего состава.',
            }
          ]},
        {p: 'Учебный комбинат осуществляет образовательную деятельность на основании ' +
            'лицензии от 11.09.2015 г. за №036529.'},
        {h4: 'Набор проводится по следующим направлениям:'},
        {ul: [
          'подготовка судоводителей;',
          'подготовка судовых механиков;',
          'подготовка судоводителей с правом эксплуатации судовой двигательной установки;',
          'подготовка членов экипажа земснаряда;',
          'подготовка членов экипажа земснаряда с правом эксплуатации судовой двигательной установки;',
          'подготовка судовых механиков;',
          'подготовка судовых радиоспециалистов;',
          'подготовка рядового состава.',
          ]},
        {h4: 'Дополнительная подготовка специалистов:'},
        {ul: [
            'для работы на нефтяных танкерах (рядовой состав);',
            'для работы на нефтяных танкерах и управлению нефтяными операциями (командный состав);',
            'для работы на пассажирском судне (рядовой состав);',
            'по управлению неорганизованной массой людей (командный состав);',
            'по использованию радиолокационной станции;',
            'по использованию электронных карт.',
          ]},
        {h4: 'Повышение квалификации:'},
        {ul: [
            'противопожарная подготовка членов экипажей судов внутреннего плавания, ' +
            'осуществляющих перевозки взрыво-, пожароопасных грузов;',
            'противопожарная подготовка членов экипажей судов внутреннего плавания.',
          ]},
        {plink: [
            {
              before: 'Утвержденные ',
              link: {
                name: 'программы подготовки членов экипажей судов внутреннего водного плавания ',
                to: '/'
              },
              after: 'указаны на сайте Федерального агентства морского и речного транспорта.',
            }
          ]},
        {slider: [
            {
              link: '/slider/content/education/1-1.jpg',
              title: 'Здание рязанского учебного комбината'
            },
            {
              link: '/slider/content/education/1-2.jpg',
              title: 'Аудитория учебного комбината'
            },
            {
              link: '/slider/content/education/1-3.jpg',
              title: 'Методические материалы'
            },
          ]},
      ]
    },
    vacancy: {
      page: 'vacancy',
      title: 'Вакансии',
      content: [
        {h4: 'В Службу капитального строительства и ремонта требуется: '},
        {h3: 'Ведущий инженер сметного отдела '},
        {h4: 'Требования:'},
        {ul: [
          'образование высшее: строительное или экономическое (желательно экономика в строительстве);',
          'стаж работы не менее 2 лет;',
          'опытный ПК-пользователь Microsoft Office (Excel, Word); 1C, Outlook, Internet;',
          'знание законодательных и иных нормативно-правовых актов, регулирующих деятельность строительных организаций (свод правил (СП), методических документов в строительстве (МДС), руководящих документов в строительстве (РДС), сметных нормативов, подлежащих применению при определении сметной стоимости объектов капитального строительства, строительство которых финансируется с привлечением средств федерального бюджета;',
          'умение работать в сметной программе: ПК Грандсмета  или Smeta.ru;',
          'умение читать проектные чертежи;',
          'коммуникабельность, знание грамматики;',
          'основы делопроизводства;',
          'навыки делового письма.',
          ]},
        {h4: 'Обязанности:'},
        {ul: [
          'составлять сметную документацию на текущий, капитальный ремонт, модернизацию и ' +
          'реконструкцию гидротехнических сооружений, объектов путевого хозяйства, служебно-бытовых ' +
          'и жилых зданий в соответствии с проектами и ремонтными актами;',
          'проверять и корректировать сметную документацию, составленную работниками линейных подразделений;',
          'рассчитывать начальную (максимальную) цену контракта, в соответствии с законодательством Российской ' +
          'Федерации;',
          'проверять акты выполненных работ по форме КС-2;',
          'осуществлять деловую переписку.',
          ]},
        {h4: 'Контакты:'},
        {pbr: [
          'Начальник сметного отдела – Журавлева Татьяна Михайловна',
          'Тел. +7 (499) 638-42-01 доб. 437',
          'Инженер 1 категории – Григорьева Евгения Андреевна',
          'Тел. +7 (499) 638-42-01 доб. 652',
          'Адрес: г. Москва, ул. Водников, д. 2, стр. 14',
          ]},
        {line: ''},
        {h4: 'В Московском РГС – филиале ФГБУ «Канал имени Москвы» требуются:'},
        {h3: 'Бухгалтер 2 категории'},
        {h4: 'Подразделение:'},
        {p: 'Аппарат управления'},
        {h4: 'Должностные обязанности:'},
        {ul: [
          'расчет заработной платы на 200 человек;',
          'подготовка заявок и реестров на выплату заработной платы;',
          'подготовка и сдача отчетов в ФСС, ПФР и ИФНС (по страховым взносам).',
          ]},
        {h4: 'Требование:'},
        {ul: [
            'образование среднее профессиональное или высшее;',
            'опыт расчета заработной платы бюджетного учреждения;',
            'уверенный пользователь1С8 Зарплата и кадры, 1СПредприятие, Exсel, Word, Outlook;',
            'опыт работы по подготовке отчетов в ПФР и ИФНС;',
            'знание законодательства по участку работы расчет заработной платы.',
          ]},
        {h4: 'Контакты:'},
        {p: 'Коновалова Елена Михайловна, главный бухгалтер, +7 (499) 638-42-75'},
        {h3: 'Бухгалтер'},
        {h4: 'Подразделение:'},
        {p: 'Жилищный ремонтно-эксплуатационный участок'},
        {h4: 'Должностные обязанности:'},
        {ul: [
            'расчет заработной платы на 20 человек;',
            'подготовка заявок и реестров на выплату заработной платы;',
            'подготовка и сдача отчетов в ФСС, ПФР и ИФНС (по страховым взносам); начисление квартплаты.',
          ]},
        {h4: 'Требование:'},
        {p: 'образование среднее профессиональное или высшее, опыт расчета заработной платы ' +
            'бюджетного учреждения, уверенный пользователь1С8 Зарплата и кадры, 1СПредприятие, ' +
            'Exсel, Word, Outlook, опыт работы по подготовке отчетов в ПФР и ИФНС, знание законодательства ' +
            'по участку работы расчет заработной платы.'},
        {h4: 'Контакты:'},
        {p: 'Коновалова Елена Михайловна, главный бухгалтер, 8-499-638-42-75'},
      ]
    },
    feedback: {
      page: 'feedback',
      title: 'Обращения граждан',
      content: [
        {p: 'Обращения граждан в Федеральное государственное бюджетное учреждение ' +
            '«Канал имени Москвы» могут быть направлены:'},
        {ul: [
          'в письменном виде по адресу: 125362, г. Москва, ул. Водников, д. 1;',
          'на электронную почту: kim@kim-online.ru;',
          'в электронном виде через форму обратной связи на официальном сайте Федерального ' +
          'государственного бюджетного учреждения «Канал имени Москвы».',
          ]},
        {plink: [
            {
              before: 'Порядок рассмотрения обращений граждан, направленных в адрес Федерального государственного ' +
                'бюджетного учреждения «Канал имени Москвы», определяется ',
              link: {
                name: 'Федеральным законом от 02 мая 2006 г. N 59-ФЗ "О порядке рассмотрения обращений граждан Российской Федерации"',
                to: '/'
              },
              after: '.',
            }
          ]},
        {plink: [
            {
              before: '',
              link: {
                name: 'График личного приема граждан',
                to: '/'
              },
              after: '',
            }
          ]},

      ]
    },
    faq: {
      page: 'faq',
      title: 'Вопрос-ответ',
      content: [
        {h4: 'Какие шлюзы находятся в ведении ФГБУ «Канал имени Москвы»?'},
        {p: 'Рыбинский № 11-12Р, Угличский № 10У, №№ 1 – 10, Трудкоммуна, Андреевка, ' +
            'Софьино, Фаустово, Северка, Белоомут, Кузьминск.'},
        {h4: 'Как сократить время ожидания шлюзования маломерного судна?'},
        {p: 'Накануне необходимо обратиться в диспетчерскую службу по тел. (495) 491-32-64 ' +
            'и согласовать время подхода к шлюзу с диспетчером'},
        {h4: 'Куда обращаться для оформления удостоверения личности моряка и мореходной книжки?'},
        {pbr: [
            'Необходимо обратиться в службу навигационного обслуживания для получения регистрационного номера.',
            'Соответствующие обращения необходимо направлять по адресу: ulm@fgbu-kim.ru',
            'Телефон для справок: +7 (499) 638-42-13, +7 (499) 638-42-01, доб. 640, 622.',
            'Выдача готовых документов производится по адресу: Москва, ул. Водников, д. 16, каб. 1.'
          ]},
        {plink: [
            {
              before: '',
              link: {
                name: 'Подробности здесь',
                to: '/'
              },
              after: '',
            }
          ]},
        {faqForm: ''}
      ]
    }
  }
  const menu = menuData
  const data = pagesData[ctx.params.pageName]

  return { props: {data, ctx ,menu}}
}

export const getStaticPaths = async () => {
  return {
    fallback: false,
    paths: [
      { params: {pageName: 'about'}},
      { params: {pageName: 'structure'}},
      { params: {pageName: 'branches'}},
      { params: {pageName: 'history'}},
      { params: {pageName: 'museum'}},
      { params: {pageName: 'education'}},
      { params: {pageName: 'vacancy'}},
      { params: {pageName: 'feedback'}},
      { params: {pageName: 'faq'}},
    ]
  }
}

export default AboutPages