import React from 'react'
import {menu as menuData} from '../../assets/menu'
import {makeContent} from '../../utils/makeContent'
import {Footer, Head, Header, InnerPage} from '../../modules';


const AboutPages = (props) => {

  const pageContent = makeContent(props.data.content)

  return (
    <div className='container'>
      <Head/>
      <Header menu={props.menu}/>
      <InnerPage menu={props.menu} sidebar={4} title={props.data.title} pageContent={pageContent}/>
      <Footer/>
    </div>

    )
}

export const getStaticProps = async (ctx) => {

  const pagesData = {
    lk: {
      page: 'lk',
      title: 'Личный кабинет',
      content: [
        {h4: 'Возможности'},
        {p: 'Подача заявлений на оказание услуг:'},
        {ul: [
          'Реализация цифровых информационных справочных наборов, включающих в себя государственные электронно-навигационные карты Московского бассейна',
          ]},
        {p: 'Техническая поддержка: kim@kim-online.ru'},
      ]
    },
    dispatcher: {
      page: 'dispatcher',
      title: 'Диспетчерское регулирование',
      content: [
        {p: 'Диспетчерское регулирование движения судов обеспечивает безопасность судоходства путем предоставления следующей информации:'},
        {ul: [
          'о путевых условиях и их изменениях;',
          'о габаритах судового хода;',
          'об изменениях в составе навигационного ограждения;',
          'об условиях прохождения регулируемых участков судоходного пути и других условиях плавания;',
          'о прогнозах погоды и транспортных происшествиях на бассейне.',
          ]},
        {p: 'В соответствии с Порядком диспетчерского регулирования движения судов на внутренних водных путях Российской Федерации, диспетчерскому регулированию движения судов на ВВП подлежат все самоходные суда (кроме маломерных судов) и буксируемые (толкаемые) составы.'},
        {p: 'Диспетчерское регулирование движения судов осуществляется на договорной основе.'},
        {h4: 'Документы:'},
        {fileLink: {
            name: 'Образец заявления на заключение договора для физического лица',
            to: '/services/dispatcher/test.pdf',
          }},
        {fileLink: {
            name: 'Требование к заявке на заключение договора',
            to: '/services/dispatcher/test.pdf',
          }},
        {fileLink: {
            name: 'Типовая форма договора на оказание услуг по диспетчерскому регулированию движения судов',
            to: '/services/dispatcher/test.pdf',
          }},
        {plink: [
            {
              before: '',
              link: {
                name: 'Ставки сборов с судов за услугу по обеспечению безопасности плавания судов по внутренним водным путям, оказываемые ФГБУ «Канал имени Москвы» (навигационный сбор)',
                to: '/services/dispatcher/test.pdf',
              },
              after: '',
            }
          ]},
        {plink: [
            {
              before: '',
              link: {
                name: 'Приказ Федеральной службы по тарифам (ФСТ России) № 184-т/5 от 08.10.2013 г. «Об утверждении Правил применения сборов (тарифов) с судов за услуги субъектов естественных монополий в речных портах и по использованию инфраструктуры внутренних водных путей»',
                to: '/services/dispatcher/test.pdf',
              },
              after: '',
            }
          ]},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба навигационного обслуживания',
            'Тел.: +7 (499) 638-42-01 доб. 745, 730, 633, 975',
            'E-mail: dogovor@fgup-kim.ru',
          ]},
      ]
    },
    dock: {
      page: 'dock',
      title: 'Предоставление судам причалов',
      content: [
        {h4: 'Документы:'},
        {plink: [
            {
              before: '',
              link: {
                name: 'Типовая форма договора на оказание услуг по предоставлению судам причалов',
                to: '/services/dock/test.pdf',
              },
              after: '',
            }
          ]},
        {plink: [
            {
              before: '',
              link: {
                name: 'Тарифы на услуги по стоянке судов у причальных сооружений',
                to: '/services/dock/test.pdf',
              },
              after: '',
            }
          ]},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба навигационного обслуживания',
            'Тел.: +7 (499) 638-42-01 доб. 745, 730, 633, 975',
            'E-mail: dogovor@fgup-kim.ru',
          ]},
      ]
    },
    cartography: {
      page: 'cartography',
      title: 'Картография',
      content: [
        {infoBlockDisclose: {
          title: 'Цифровые информационные справочные наборы, состоящие из государственных электронных навигационных карт Московского бассейна',
          data: [
            {h4: 'Картографическая служба'},
            {pbr: [
                'enk@fgbu-kim.ru',
                'Тел.: +7 (499) 638-42-01, доб. 686',
              ]},
          ]
          }},
        {infoBlockDisclose: {
            title: 'Атлас ЕГС Европейской части РФ, том 2, изд. 2017 г.',
            data: [
              {pimg: {
                img: '/services/cartography/map1.jpg',
                data: [
                  'Содержит карты и лоцийные сведения на водный путь от города Москва до деревни Хопылево, городов Череповец и Тверь. Карты на озёрную часть Рыбинского водохранилища даны только по основным транзитным 65 и 63 судовым ходам.',
                  'Лоцийные сведения, помещённые на картах Атласа, содержат рекомендации и предупреждения, направленные на обеспечение безопасности судоходства, а также другие полезные судоводителям лоцийные описания.'
                ]
                }},
              {p: 'Навигационное оборудование на картах Атласа показано по состоянию на начало навигации 2018 года.'},
              {ul: [
                'Глубины на картах Атласа даны в метрах от нормального подпорного уровня.',
                'Высоты судоходных пролётов мостов и воздушных переходов даны от нормального подпорного уровня, а в некоторых случаях – от расчетного судового уровня.',
                'Расстояния на картах Атласа даны в километрах от Южного порта Москвы.',
                ]},
              {p: 'Даны: навигационно-гидрографический очерк; алфавитный указатель; условные обозначения, используемые на листах Атласа; схематический продольный профиль водного пути от города Москва до селения Хопылёво; схема расположения листов томов Атласа ЕГС; схема расположения карт тома 2 Атласа ЕГС.'},
              {p: 'При плавании надлежит пользоваться картой, откорректированной на дату плавания.'},
              {p: 'Масштабы карт на реки Москва и канала имени Москвы, рукавов Пироговский и Тишковский -1:10 000; Горьковского, Иваньковского, Угличского водохранилищ, речной и северной частей Рыбинского водохранилища - 1: 25 000; озёрной части Рыбинского водохранилища -1:100 000, обзорная схема Рыбинского водохранилища - 1:250 000.'},
              {p: 'Формат - «альбом», 33x38 см, мягкий переплёт.'},
              {plink: [
                  {
                    before: '',
                    link: {
                      name: 'Стоимость на лоцманские карты внутренних водных путей Московского бассейна на период навигации 2020 года и межнавигационный период 2020 – 2021 гг.',
                      to: '/services/cartography/test.pdf',
                    },
                    after: '',
                  }
                ]},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ]
          }},
        {infoBlockDisclose: {
            title: 'Карта реки Москва от города Красногорск до устья, изд. 2005 г.',
            data: [
              {pimg: {
                  img: '/services/cartography/map2.jpg',
                  data: [
                    'Охватывает участок реки Москва протяжённостью 201 км от города Красногорск до устья.',
                    'Глубины на карте и высоты затопляемых берегов даны от проектного уровня.',
                    'Сведения об отметках проектного уровня по опорным водомерным постам приведены в разделе «Габариты пути».',
                  ],
                }},
              {p: 'Высотный габарит мостов и воздушных переходов дан от нормального подпорного уровня.'},
              {p: 'Расстояния по оси судового хода даны в километрах от устья реки Москва, засечены и оцифрованы через 1 км. На участке реки от Южного порта до города Красногорск расстояния показаны как от устья, так и от Южного порта (в скобках).'},
              {p: 'Навигационное оборудование на листах карты показано по состоянию на текущую навигацию с учётом корректуры, которая прилагается.'},
              {p: 'Лоцийные сведения, помещённые на листах карты, содержат наиболее важные рекомендации и предупреждения, направленные на обеспечение безопасности судоходства, а также другие полезные судоводителю навигационные описания.'},
              {p: 'Даны: навигационно-гидрографический очерк; алфавитный указатель; условные обозначения, используемые на листах карты; схема расположения листов карты реки Москва. При плавании надлежит пользоваться картой, откорректированной на дату плавания.'},
              {p: 'Карта составлена в масштабе 1:10 000.'},
              {p: 'Формат - «альбом», 34x38 см, мягкий переплёт.'},
              {plink: [
                  {
                    before: '',
                    link: {
                      name: 'Стоимость на лоцманские карты внутренних водных путей Московского бассейна на период навигации 2020 года и межнавигационный период 2020 – 2021 гг.',
                      to: '/services/cartography/test.pdf',
                    },
                    after: '',
                  }
                ]},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Карта реки Ока от города Коломна до устья, изд. 2014 г.',
            data: [
              {pimg: {
                  img: '/services/cartography/map3.jpg',
                  data: [
                    'Охватывает участок реки Ока протяжённостью 850 км от города Коломна до устья.',
                    'Тексты, помещённые на листах карты, содержат рекомендации и предупреждения, направленные на обеспечение безопасности судоходства, а также другие полезные судоводителю сведения Навигационное оборудование на листах карты показано по состоянию на начало навигации 2014 года.',
                  ],
                }},
              {p: 'Глубины на карте и высоты затопляемых берегов даны от проектного уровня.'},
              {p: 'Высоты судоходных пролётов мостов даны от проектного и расчётного уровней. Высоты воздушных переходов даны от проектного и максимального уровней. Расстояния по оси основного судового хода даны в километрах от устья реки Ока, засечены через 1 км и оцифрованы через 2 км.'},
              {p: 'Даны навигационно-гидрографический очерк; алфавитный указатель, условные обозначения, используемые на листах карты; схема расположения листов карты.'},
              {p: 'При плавании надлежит пользоваться картой, откорректированной на дату плавания.'},
              {p: 'Карта составлена в масштабе 1:25 000.'},
              {p: 'Формат - «альбом», 34x38 см, мягкий переплёт.'},
              {plink: [
                  {
                    before: '',
                    link: {
                      name: 'Стоимость на лоцманские карты внутренних водных путей Московского бассейна на период навигации 2020 года и межнавигационный период 2020 – 2021 гг.',
                      to: '/services/cartography/test.pdf',
                    },
                    after: '',
                  }
                ]},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Карта реки Ока от города Калуга до города Коломна, изд. 2012 г.',
            data: [
              {pimg: {
                  img: '/services/cartography/map4.jpg',
                  data: [
                    'Охватывает участок реки Ока протяжённостью 254 км от города Калуга до города Коломна.',
                    'Тексты, помещённые на листах карты, содержат рекомендации и предупреждения, направленные на обеспечение безопасности судоходства, и другие полезные судоводителю лоцийные сведения. Навигационное оборудование на листах карты показано по состоянию на начало навигации 2012 года.',
                  ],
                }},
              {p: 'Глубины на карте и высоты затопляемых берегов даны от проектного уровня.'},
              {p: 'Высоты судоходных пролётов мостов указаны от проектного и расчётного уровней, высоты воздушных переходов от проектного и максимального уровней. Расстояния по оси судового хода даны в километрах от устья реки Ока, засечены и оцифрованы через 1 км.'},
              {p: 'Даны навигационно-гидрографический очерк; алфавитный указатель; условные обозначения, используемые на листах карты; схема расположения листов карты.'},
              {p: 'При плавании надлежит пользоваться картой, откорректированной на дату плавания.'},
              {p: 'Карта составлена в масштабе 1:10 000.'},
              {p: 'Формат - «книга», 34x24 см, мягкий переплёт.'},
              {plink: [
                  {
                    before: '',
                    link: {
                      name: 'Стоимость на лоцманские карты внутренних водных путей Московского бассейна на период навигации 2020 года и межнавигационный период 2020 – 2021 гг.',
                      to: '/services/cartography/test.pdf',
                    },
                    after: '',
                  }
                ]},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Карта Рыбинского водохранилища (настенная) от Рыбинска и Глебова до Череповца на 2-х листах, изд. 2010 г.',
            data: [
              {pimg: {
                  img: '/services/cartography/map5.jpg',
                  data: [
                    'Выполнена в проекции Меркатора.',
                    'Включает все судовые хода с заходами на Весьегонск, Брейтово, в реки Молога, Кондоша, Суда.',
                    'Глубины приведены к нормальному подпорному уровню водохранилища.',
                  ],
                }},
              {p: 'Отображены: вся навигационная обстановка (плавучая и береговая); убежища, затопленные русла рек и другие объекты. Дана наземная часть полосой 5 см в масштабе карты от уреза воды.'},
              {p: 'Общий размер 184x124 см. Масштаб 1:100 000.'},
              {plink: [
                  {
                    before: '',
                    link: {
                      name: 'Стоимость на лоцманские карты внутренних водных путей Московского бассейна на период навигации 2020 года и межнавигационный период 2020 – 2021 гг.',
                      to: '/services/cartography/test.pdf',
                    },
                    after: '',
                  }
                ]},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Схема водных путей ФГУП «Канал имени Москвы», изд. 2000 г.',
            data: [
              {pimg: {
                  img: '/services/cartography/map6.jpg',
                  data: [
                    'Обзорная цветная схема зоны деятельности ФГУП «Канал имени Москвы» (на одном листе).',
                    'На схеме показаны административные границы областей и границы зоны деятельности ФГУП «Канал имени Москвы».',
                    'Обозначены основные объекты: шлюзы, гидроузлы, порты, пристани, мосты, пути сообщения и т.д.',
                  ],
                }},
              {p: 'Размер 70x100 см.'},
              {plink: [
                  {
                    before: '',
                    link: {
                      name: 'Стоимость на лоцманские карты внутренних водных путей Московского бассейна на период навигации 2020 года и межнавигационный период 2020 – 2021 гг.',
                      to: '/services/cartography/test.pdf',
                    },
                    after: '',
                  }
                ]},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Схема причальных сооружений ФГУП «Канал имени Москвы», изд. 2013 г.',
            data: [
              {pimg: {
                  img: '/services/cartography/map7.jpg',
                  data: [
                    'Обзорная цветная схема причальных сооружений ФГУП «Канал имени Москвы» (на одном листе).',
                    'Обозначены основные объекты: шлюзы, гидроузлы, порты, пристани, мосты, пути сообщения и т.д.',
                  ],
                }},
              {p: 'Размер 75x125 см.'},
              {plink: [
                  {
                    before: '',
                    link: {
                      name: 'Стоимость на лоцманские карты внутренних водных путей Московского бассейна на период навигации 2020 года и межнавигационный период 2020 – 2021 гг.',
                      to: '/services/cartography/test.pdf',
                    },
                    after: '',
                  }
                ]},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
      ]
    },
    fleetWork: {
      page: 'fleetWork',
      title: 'Работы флота',
      content: [
        {infoBlockDisclose: {
            title: 'Выставление, обслуживание и снятие судоходной обстановки',
            data: [
              {p: 'Выставление, обслуживание и снятие знаков судоходной обстановки на участках водных путей без обстановки, в том числе на подходах к портам, причалам, на переправах, у водовыпусков, водозаборов и других сооружений, на подводных переходах.'},
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Рыбинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тверским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Московским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Серпуховским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Рязанским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Муромским РВП, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                'реквизиты компании;',
                'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Изыскательские работы',
            data: [
              {p: 'Промеры глубин, съемка береговой полосы, камеральная обработка материала, подготовка наряд-задания для выполнения дноуглубительных работ с нанесением прорези, подсчет объёмов дноуглубительных работ.'},
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Рыбинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тверским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Московским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Серпуховским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Рязанским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Муромским РВП, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                  'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                  'реквизиты компании;',
                  'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Дноуглубительные работы',
            data: [
              {p: 'Дноуглубительные и землечерпательные работы на подходах к причалам, затонам и портам, на акватории причалов, портов, пристаней, намыв грунта, разработка и засыпка траншей подводных переходов для прокладки коммуникаций и др.'},
              {p: 'В работах задействуются землесосные рефулерные снаряды (выгрузка изъятого грунта в воду и на берег) производительностью 450 м3 /час и 750 м3 /час, многочерпаковые шаландовые земснаряды (выгрузка изъятого грунта в воду) производительностью от 180 м3 /час до 550 м3 /час.'},
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Рыбинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тверским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Московским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Серпуховским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Рязанским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Муромским РВП, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                'объем (для определения объёма необходимо проведение промеров глубин);',
                'место отвала извлечённого грунта;',
                'договор на водопользование/решение о предоставлении водных объектов в пользование (если работы связаны с изменением дна реки);',
                'проект производства работ, согласованный с контролирующими органами, в том числе с Московско-Окским территориальным управлением Росрыболовства;',
                'реквизиты компании;',
                'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Дноочистительные работы',
            data: [
              {p: 'Извлечение и подъем посторонних предметов со дна акватории за пределами судового хода, очистку русел рек и береговой полосы от топляков, корчей и т.д.'},
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Рыбинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тверским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Московским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Серпуховским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Рязанским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Муромским РВП, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                  'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                  'реквизиты компании;',
                  'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Тральные работы',
            data: [
              {p: 'Траление подходов к затонам, причалам и пристаням по заявкам судовладельцев, обнаружение подводных препятствий. В качестве средств траления применяются мягкие и жесткие тралы.'},
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Рыбинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тверским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Московским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Серпуховским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Рязанским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Муромским РВП, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                  'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                  'реквизиты компании;',
                  'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Водолазные работы',
            data: [
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Рыбинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Яхромским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Волжским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Московским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                  'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                  'реквизиты компании;',
                  'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Подъём затонувших плавсредств и прочей техники',
            data: [
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Яхромским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Волжским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                  'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                  'реквизиты компании;',
                  'контактные данные.',
                  'ко грузе: габариты, вес, кол-во;',
                  'о флоте: длина, осадка.',
                ]},
              {p: 'До начала работ необходимо предоставить технологические схемы: производства перегрузочных работ, размещения оборудования на причале, организации движения перегрузочной техники и автотранспорта.'},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Погрузо-разгрузочные работы',
            data: [
              {p: 'Работы по погрузке и разгрузке тяжеловесного и негабаритного груза и оборудования производятся уникальным плавкраном КПЛ-351, грузоподъемностью 350 тонн.'},
              {p: 'Работы по погрузке и разгрузке нерудных строительных материалов производятся плавкранами грузоподъемностью 5 и 16 тонн.'},
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Яхромским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Волжским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                  'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                  'реквизиты компании;',
                  'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Перевозка грузов',
            data: [
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Рыбинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Волжским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Рязанским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Муромским РВП, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                  'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                  'реквизиты компании;',
                  'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
        {infoBlockDisclose: {
            title: 'Буксировка судов',
            data: [
              {p: 'Буксировка судов, составов и иных плавучих объектов по внутренним водным путям Московского бассейна.'},
              {plink: [
                  {
                    before: 'Работы выполняются флотом филиалов ФГБУ «Канал имени Москвы»: ',
                    link: {
                      name: 'Рыбинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тверским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Московским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Серпуховским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Рязанским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Муромским РВП, ',
                      to: '/',
                    },
                    after: '',
                  },
                  {
                    before: '',
                    link: {
                      name: 'Тушинским РГС, ',
                      to: '/',
                    },
                    after: '',
                  },
                ]},
              {p: 'Заявка на выполнение работ должна содержать:'},
              {ul: [
                  'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
                  'реквизиты компании;',
                  'контактные данные.',
                ]},
              {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
              {h4: 'Контакты:'},
              {pbr: [
                  'Служба платных услуг',
                  'Тел.: +7 (499) 638-42-01 доб. 981, 606',
                  'E-mail: kim@kim-online.ru',
                ]},
            ],
          }},
      ]
    },
    fleetCamp: {
      page: 'fleetCamp',
      title: 'Отстой флота',
      content: [
        {p: 'Услуги по отстою судов и плавучих средств нетранспортного назначения, включая краткосрочный, долгосрочный отстой, отстой в межнавигационный (зимний) период.'},
        {plink: [
            {
              before: 'Отстой судов возможен в филиалах ФГБУ «Канал имени Москвы»: ',
              link: {
                name: 'Волжском РГС, ',
                to: '/',
              },
              after: '',
            },
            {
              before: '',
              link: {
                name: 'Тверском РГС, ',
                to: '/',
              },
              after: '',
            },
            {
              before: '',
              link: {
                name: 'Тушинском РГС, ',
                to: '/',
              },
              after: '',
            },
          ]},
        {p: 'Заявка на выполнение работ должна содержать:'},
        {ul: [
            'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием места проведения работ;',
            'реквизиты компании;',
            'контактные данные.',
          ]},
        {p: 'Стоимость работ рассчитывается на основании калькуляции с учетом вида и объема работ.'},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба платных услуг',
            'Тел.: +7 (499) 638-42-01 доб. 981, 606',
            'E-mail: kim@kim-online.ru',
          ]},
      ]
    },
    agreements: {
      page: 'agreements',
      title: 'Технические согласования',
      content: [
        {h4: 'О согласованиях на внутренних водных путях Московского бассейна'},
        {p: 'В соответствии со статьями 9 и 10 Кодекса внутреннего водного транспорта Российской Федерации по согласованию ФГБУ «Канал имени Москвы» (выполняет функции администрации бассейна внутренних водных путей), на внутренних водных путях Московского бассейна осуществляются следующие действия:'},
        {ul: [
          'строительство и эксплуатация (в т.ч. ремонт, реконструкция, демонтаж) сооружений;',
          'добыча общераспространенных полезных ископаемых (ОПИ);',
          'установка владельцами сооружений навигационных огней и знаков, другого оборудования;',
          'использование водных объектов для целей рыболовства, в случае если такие объекты используются для целей судоходства;',
          'предоставление земельных участков, расположенных в пределах береговой полосы, и выделение участков акваторий ВВП, строительство на них каких-либо зданий, строений и сооружений.',
          ]},
        {p: 'С разрешения ФГБУ «Канал имени Москвы» осуществляются:'},
        {ul: [
          'устройство временных сооружений для причаливания, швартовки и стоянки судов и плавучих объектов, погрузки, выгрузки и хранения грузов, посадки на суда и высадки с судов пассажиров;',
          'строительство временных строений и проведение других необходимых работ, в случаях непредвиденных зимовок судов или транспортных происшествий с судами.',
          ]},
        {h4: 'В случаях, когда решение о согласовании какого-либо действия на ВВП, из указанных выше, принимается с учетом выполнения необходимых (технических) условий, выдача таких условий осуществляется ФГБУ «Канал имени Москвы» в соответствии с Уставом Учреждения.'},
        {h4: 'Примерный перечень объектов, в отношении которых выдаются согласования и технические условия:'},
        {p: 'мосты (в т.ч. наплавные), пассажирские подвесные и буксировочные канатные дороги, подводные переходы, боновые заграждения, воздушные переходы, водозаборы, водовыпуски, очистные сооружения, рыбозащитные и сороудерживающие сооружения, причалы (в т.ч. причальные стенки, причалы понтонного типа, пирсы), набережные, берегоукрепления, лестничные сходы, паромные переправы, базы (отдыха, спортивные, ремонтные и т.п.), воднолыжные канатные дороги, карьеры, места организации пляжа и зоны отдыха и др.'},
        {h4: 'Этапы согласования и выдачи технических условий'},
        {p: 'До начала любого действия на ВВП из вышеуказанного списка, в том числе: '},
        {ul: [
          'до начала проектирования (в случаях, когда проект необходим);',
          'по результатам рассмотрения проектной документации;',
          'до начала производства работ (по инженерно-геологическим изысканиям, строительных, по реконструкции, по ремонту, демонтажу, погрузо-разгрузочных, буровых, добычных, геологоразведочных и иных работ. ',
          ]},
        {h4: 'Перечень рекомендуемых документов для получения согласования и технических условий'},
        {p: 'Письмо-заявление на имя руководителя ФГБУ «Канал имени Москвы», содержащее следующую информацию:'},
        {ul: [
            'реквизиты, контактное лицо, контактный телефон – для юридического лица;',
            'копия документа, удостоверяющего личность, контактный телефон – для физического лица;',
            'наименование действия на ВВП, которое необходимо согласовать;',
            'наименование объекта согласования;',
            'местоположение объекта согласования (водный объект, берег, населенный пункт или расстояние от характерного объекта).',
          ]},
        {p: 'Приложения к письму-заявлению:'},
        {ul: [
          'картографический материал с нанесенным объектом согласования с привязкой к характерным местам окружающей местности (1 из 3): ситуационный план (масштаб 1:10000) или спутниковый снимок или выкопировка из действующей на дату обращения лоцманской карты;',
          'пояснительная записка (в зависимости от вопроса или этапа согласования), например: о технических параметрах и назначении объекта согласования или предпроектные проработки с указанием предварительных характеристик объекта; о планируемых изменениях в параметрах объекта, изменении технологии производства работ; содержащая описание характеристик навигационных огней и знаков.',
          'иные документы и материалы на усмотрение заявителя;',
          'по результатам рассмотрения представленных материалов при необходимости заявителю сообщается о предоставлении дополнительных материалов.',
          ]},
        {h4: 'Рекомендуемый состав проектных и рабочих материалов'},
        {ul: [
          'раздел «Пояснительная записка» в части, содержащей сведения об объекте: назначение, местоположение, технические параметры, а также об организации (методы, технология) планируемых работ;',
          'раздел «Навигационное оборудование» (объекты – надводные, подводные переходы, водозаборы, водовыпуски, причальные сооружения);',
          'расчет РСУ (объекты – мосты, канатные дороги);',
          'расчет уровня высоких вод (объекты – воздушные линии электропередач, связи);',
          'раздел «Акватория, рейды и водные подходы» (объекты - причальные сооружения);',
          'раздел «Обеспечение безопасных условий судоходства» (в случае необходимости переноса судового хода или его сужения при производстве работ в границах судового хода);',
          'чертежи объекта (генеральный план с обозначенными размерами, продольный профиль, поперечные разрезы в абсолютных отметках Балтийской системы высот), план русловой съемки участка давностью не более двух лет с нанесенным на него объектом;',
          'проект производства работ в части, содержащей сведения о технологии планируемых работ, в том числе о типах используемых технических средств и их характеристиках, схему производства работ и расстановки технических средств, календарный график.',
          ]},
        {h4: 'Согласование выделения участков акваторий ВВП осуществляется в порядке, установленном постановлениями Правительства Российской Федерации от 30.12.2006 № 844, от 12.03.2008 № 165. Согласование добычи общераспространенных полезных ископаемых осуществляется в соответствии с Порядком согласования добычи общераспространенных полезных ископаемых на внутренних водных путях Российской Федерации, утвержденным приказом Минтранса России от 09.02.2018 № 55.'},
        {p: 'Выдача согласования или технических условий, согласно приказа от 19.08.2015 № 01-02-66 «Об утверждении Инструкции по делопроизводству ФГБУ «Канал имени Москвы», осуществляется в срок до одного месяца с момента регистрации письма-заявления.'},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба технических согласований',
            'Тел.: +7 (499) 638-42-01 доб. 732, 913, 634, 773, 464, 774',
            'E-mail: kim@kim-online.ru',
          ]},
      ]
    },
    electricityTransmission: {
      page: 'electricityTransmission',
      title: 'Передача электроэнергии',
      content: [
        {p: 'ФГБУ «Канал имени Москвы» входит в состав территориальных сетевых организаций (ТСО) Московской области и оказывает услуги по передаче электроэнергии смежным территориальным сетевым организациям Московской области, подключенным к сетям Учреждения.'},
        {p: 'Объем услуг по передаче электроэнергии ТСО составляет около 380 млн кВт·ч в год. Передача электроэнергии осуществляется по электрическим сетям Учреждения, имеющим в своем составе:'},
        {p: '1) Распределительные подстанции суммарной установленной мощностью 250 МВА, в том числе:'},
        {ul: [
          'две подстанции напряжением 110/35/6 кВ при насосных станциях №183 «Яхрома» и №186 «Икша I»;',
          'две подстанции напряжением 110/6 кВ при насосных станциях №184 «Комсомольская», №185 «Икша II»;',
          'два открытых распределительных устройства напряжением 110 кВ Иваньковской ГЭС №191 и Сходненской ГЭС №193;',
          'одна подстанция напряжением 35/6 кВ №128 «Дмитровская»;',
          '49 подстанций напряжением 6 и 10 кВ закрытых, мачтовых и комплектных.',
          ]},
        {p: '2) Воздушные линии электропередачи общей протяженностью 166,29 км:'},
        {ul: [
          '110 кВ – «Яхрома – Комсомольская», «Яхрома – Икша II», «Икша I – Икша II», «Икша I – Комсомольская»;',
          '35 кВ – «Яхрома – Инженерная – Дмитров», «Яхрома – Тяговая Западная», «Яхрома – Тяговая Восточная», «Дмитров – Тяговая»;',
          '6 и 10 кВ общей протяженностью 87 км;',
          '0,4 кВ общей протяженностью 23 км.',
          ]},
        {p: '3) Кабельные линии электропередачи 6 и 10 кВ общей длиной 207,8 км.'},
        {p: 'Кроме того, электроэнергетическое хозяйство ФГБУ «Канал имени Москвы» включает в себя семь гидроэлектростанций (ГЭС): Иваньковская №191, Сходненская №193, Карамышевская №194, Перервинская №195, Пироговская №199, Новотверецкая и Новоцнинская, суммарной установленной мощностью 66 МВт. Ежегодно эти ГЭС вырабатывают в среднем около 200 млн кВт·ч электроэнергии.'},
        {plink: [
            {
              before: '',
              link: {
                name: 'Раскрытие информации субъектами оптового и розничных рынков электрической энергии',
                to: '/documents/openness',
              },
              after: '',
            }
          ]},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба энергетических ресурсов',
            'Тел.: +7 (499) 638-42-01 доб. 940, 609, 937',
            'E-mail: kim@kim-online.ru',
          ]},

      ]
    },
    waterTransmission: {
      page: 'waterTransmission',
      title: 'Транспортировка воды',
      content: [
        {p: 'На фоне дефицита воды в 30-е годы XX века в генеральный план реконструкции Москвы включили создание канала, который решил бы несколько важных задач, в том числе, наполнил столичный регион питьевой водой. Источником для этого стала река Волга.'},
        {p: 'Иваньковское водохранилище (1,12 млрд куб. м) на реке Волге является самым большим и главным в системе Канала имени Москвы. Оно обеспечивает питание Канала водой круглый год.'},
        {p: 'Волжская вода, перекачиваемая каскадом насосных станций Канала, пройдя 75-километровый путь от Волги и поднявшись на высоту 38 м, заполняет чаши пяти судоходных водохранилищ водораздельного бьефа и одного отстойного водохранилища, питающего московский водопровод.'},
        {p: 'Химкинское водохранилище вмещает в себя 30 млн куб. м воды, Икшинское – 15 млн куб. м воды, Пестовское – 55 куб. м воды, Пяловское – 19 млн куб. м воды, Клязьминское – 88 млн куб. м воды. Они являются судоходными и вода в них поступает за счет перекрытия плотин русел рек Икша, Клязьма (приток Оки), Уча (приток Клязьмы) и Химка (приток реки Москвы). При этом 146 млн куб. м воды, наполняющие Учинское водохранилище, предназначены только для водоснабжения столицы. В том числе, в нем накапливается вода и для питьевых целей.'},
        {p: '92% воды подается по Каналу в водораздельный бьеф из Иваньковского водохранилища, остальные 8% приходной части водного баланса покрываются естественным притоком.'},
        {p: 'Водохранилища водораздельного бьефа являются центральным распределительным бассейном, из которого вода направляется всем основным потребителям.'},
        {p: 'Ежесекундно на водоснабжение Москвы расходуется порядка 19 куб. м воды. Так за период с 2009 по 2018 год средний объем воды, подаваемой из водохранилищ водораздельного бьефа на эти цели, составил 592 млн куб. м в год. А всего с 1937 года Канал имени Москвы поставил в столицу 140 млрд куб. м воды, что сопоставимо с четвертью объема Черного моря (547 млрд куб. м воды) или шестью объемами Балтийского моря (22 млн куб. м воды).'},
        {p: 'Помимо водоснабжения потребителей и организаций водные ресурсы водохранилищ водораздельного бьефа используются для следующих целей:'},
        {ul: [
          'санитарного обводнения рек Москвы, Яузы, Учи и Клязьмы;',
          'обеспечения гарантированных глубин судового хода;',
          'обеспечения работы шлюзов;',
          'выработки электроэнергии гидростанциями;',
          'рекреации.',
          ]},
        {p: 'Всего через Канал имени Москвы в столичный регион поступает до 1,5 млрд куб. м воды в год.'},
        {plink: [
            {
              before: '',
              link: {
                name: 'Раскрытие информации в сфере водоснабжения и водоотведения',
                to: '/documents/openness',
              },
              after: '',
            }
          ]},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба энергетических ресурсов',
            'Тел.: +7 (499) 638-42-01 доб. 940, 609, 937',
            'E-mail: kim@kim-online.ru',
          ]},
      ]
    },
    ferryCrossing: {
      page: 'ferryCrossing',
      title: 'Паромная переправа',
      content: [
        {plink: [
            {
              before: 'В инфраструктуре ФГБУ «Канал имени Москвы» есть две паромные переправы. Они относятся к ',
              link: {
                name: 'Волжскому району гидротехнических сооружений (РГС).',
                to: '/',
              },
              after: '',
            }
          ]},
        {p: 'Переправа №1 соединяет подмосковную Дубну с Конаковским районом Тверской области, а переправа №3 находится в районе деревни Мельдино Талдомского района Московской области.'},
        {p: 'Сегодня оба парома пропускают ежемесячно от 25 до 50 тыс. пассажиров и авто. Среднегодовой показатель достигает 180 тыс. пропусков.'},
        {p: 'Альтернативой паромной переправе служат автомобильные объезды. Обойти переправу №3 можно по Дмитровскому шоссе: путь от Мельдино до моста в районе поселения Татищево (Дмитровский район Подмосковья) составляет 45 км. Наиболее затратным является объезд переправы №1 протяженностью 140 км: от Дубны до Татищевского моста, затем в сторону города Клин и по Ленинградскому шоссе до города Конаково Тверской области. Этот маршрут занимает около двух часов, а по расходам на бензин сопоставим со стоимостью переправы.'},
        {p: 'В межнавигационный период альтернативой паромной переправе становится понтонный мост, состоящий из 20 секций. Длина моста – 120 м, ширина – 8 м.'},
        {plink: [
            {
              before: '',
              link: {
                name: 'Стоимость проезда на пароме через Канал имени Москвы',
                to: '/services/ferry/test.pdf',
              },
              after: '',
            }
          ]},
        {h4: 'Паромная переправа №1'},
        {miniMap: 'https://yandex.ru/map-widget/v1/?um=constructor%3Ac2bfaff68ce0b6a8125616780b2afb9b346d552b4c49eadd59f5766e4234d93a&amp;source=constructor'},
        {h4: 'Паромная переправа №3'},
        {miniMap: 'https://yandex.ru/map-widget/v1/?um=constructor%3A597596a8234ed01ade1676841c6c7779ae380ed1d8cb37df0bde6549ecae6dec&amp;source=constructor'},
      ]
    },
    gatewayBeyond: {
      page: 'gatewayBeyond',
      title: 'Шлюзование за пределами  установленных сроков навигации',
      content: [
        {p: 'Услуги по обеспечению пропуска судов и иных плавучих объектов по внутренним водным путям и через судоходные гидротехнические сооружения за пределами фиксированных сроков навигации.'},
        {p: 'Расчет оплаты производится пропорционально планируемому общему количеству судов, заявленных на прохождение шлюза за сроками навигации.'},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба платных услуг',
            'Тел.: +7 (499) 638-42-01 доб. 615, 606, 751, 981, 653, 651',
            'E-mail: kim@kim-online.ru',
          ]},
      ]
    },
    museum: {
      page: 'museum',
      title: 'Посещение музея',
      content: [
        {h4: 'Заявка на посещение музея должна содержать следующую информацию:'},
        {ul: [
          'письмо на имя руководителя ФГБУ «Канал имени Москвы» с указанием даты и времени посещения, количества участников;',
          'паспортные данные участников: ФИО, дата и место рождения, кем и когда выдан, регистрация;',
          'для участников младше 14 лет - данные свидетельства о рождении.',
          ]},
        {p: 'Во время посещения документы иметь при себе.'},
        {p: 'Музей расположен по адресу: 141850, Московская область, Дмитровский район, п. Деденево, ул. Комсомольская, д. 27.'},
        {plink: [
            {
              before: '',
              link: {
                name: 'Информация об экспозиции',
                to: '/about/museum',
              },
              after: '',
            }
          ]},
        {plink: [
            {
              before: '',
              link: {
                name: 'Стоимость экскурсии и посещения экспозиции музея и на период навигации 2020 года и межнавигационный период 2020-2021 годов',
                to: '/services/museum/test.pdf',
              },
              after: '',
            }
          ]},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба платных услуг',
            'Тел.: +7 (499) 638-42-01 доб. 696, 751',
            'E-mail: kim@kim-online.ru',
          ]},
      ]
    },
    foreignShip: {
      page: 'foreignShip',
      title: 'Проход иностранных судов по внутренним водным путям',
      content: [
        {p: 'Сбор взимается с иностранных судов за пользование внутренними водными путями и расположенными на них судоходными гидротехническими сооружениями.'},
        {plink: [
            {
              before: '',
              link: {
                name: 'Образец заявления на проход иностранного судна по внутренним водным путям Московского бассейна',
                to: '/services/foreignShip/test.pdf',
              },
              after: '',
            }
          ]},
        {h4: 'Участки внутренних водных путей, на которых установлен сбор*'},
        {ul: [
          'Торовские створы – Колхозник, Колхозник – Торовские створы',
          'Торовские створы – пристань Большая Волга, пристань Большая Волга – Торовские створы',
          'пристань Большая Волга – Колхозник, Колхозник – пристань Большая Волга',
          'г. Тверь – пристань Большая Волга, пристань Большая Волга – г. Тверь',
          'пристань Большая Волга – причал Щукино, причал Щукино – пристань Большая Волга',
          'причал Щукино – устье р. Ока, устье р. Ока – причал Щукино',
          ]},
        {h4: 'Ставка'},
        {p: '96,74 руб. за 1000 м3/км'},
        {p: '*Перечень внутренних водных путей Российской Федерации, по которым разрешено плавание судов под флагами иностранных государств утверждён распоряжениями Правительства Российской Федерации от 05.05.2012 г. № 734-р, от 30.06.2015 г. № 1243-р.'},
        {h4: 'При заходе иностранных судов на внутренние водные пути Московского бассейна необходимо учитывать следующее:'},
        {ul: [
          'Суда под иностранным флагом, длина которых не превышает 20 метров и общее количество людей не более двенадцати человек, оплачивают сбор за проход судна под иностранным флагом.',
          'Суда под иностранным флагом, длина которых более 20 метров оплачивают сбор за проход судна под иностранным флагом и навигационный сбор.',
          ]},
        {h4: 'Обращаем Ваше внимание, что проход по внутренним водным путям возможен только после подтверждения оплаты.'},
        {h4: 'Контакты:'},
        {pbr: [
            'Служба навигационного обслуживания',
            'Тел.: +7 (499) 638-42-01 доб. 745, 730, 633, 975',
            'E-mail: kim@kim-online.ru',
          ]},
      ]
    },
  }

  const menu = menuData
  const data = pagesData[ctx.params.pageName]

  return { props: {data, ctx ,menu}}
}

export const getStaticPaths = async () => {
  return {
    fallback: false,
    paths: [
      { params: {pageName: 'lk'}},
      { params: {pageName: 'dispatcher'}},
      { params: {pageName: 'dock'}},
      { params: {pageName: 'cartography'}},
      { params: {pageName: 'fleetWork'}},
      { params: {pageName: 'fleetCamp'}},
      { params: {pageName: 'agreements'}},
      { params: {pageName: 'electricityTransmission'}},
      { params: {pageName: 'waterTransmission'}},
      { params: {pageName: 'ferryCrossing'}},
      { params: {pageName: 'gatewayBeyond'}},
      { params: {pageName: 'museum'}},
      { params: {pageName: 'foreignShip'}},
    ]
  }
}

export default AboutPages